[
    {
        "username": "jasmash111316",
        "content": "I want to begin by saying Thanks 🙏… A lil about myself…. I am 39 have 3 children and a wife for 17 years. Money is always a factor/issue or argument in my home. I came to the discord in 2020 I believe never premium. I didn’t understand anything going on here nor have any knowledge of where or how to start! So I popped in and out and did my own thing after covid I ready wanted to learn more. I watched tons of free videos and options was the first thing I fell in love with when trading. Skip ahead….I start actually attempting to make trades on the free side and play the free watchlist things weren’t terrible…. This is 2024 Thanksgiving. I saw a great deal on the premium and took the leap. Right from the start @o.g.nikki was right there guiding me though the channels and ready to (Help keyword). I have no idea if I used the quotation correctly! Any way I got a coach @btc_jay he was great. Learned a lot about equity’s and liquidity in the market. But this wasn’t what I was used to and like a lil faster pace. As I said I had been in the free live trading with @officialethanschleder and loved options. So that was that switch up coming. Nikki listened to what I was saying and pointed me right where I need to be and Ethan became the one ☝️. He has Helped me in the last few weeks more than my coworkers of over a year!!! I will probably write more but we will wrap up here.                               I will and I can, you have something I want and I will Succeed, I will take what you have without you loosing it, I will learn I will succeed!!!   Also thanks for giving it!!!! @here",
        "timestamp": "2025-02-01 17:41:34",
        "total_reactions": 248
    },
    {
        "username": "JenniG1981",
        "content": "Ethan has been my coach for about 3 months now. I have learned so much from him that I am now finding my own profitable trades. Watching him do live trading, and hearing him think through a trade out loud on top of taking his courses has been so helpful for me. I’ve learned how to spot a good trade, use rationality to make the best decision with how heavy or light to go into a trade, and how to scale out. I highly recommend getting a coach because it has helped me become a profitable independent trader. Ethan is fantastic! Thank you @officialethanschleder",
        "timestamp": "2024-11-04 21:53:19",
        "total_reactions": 125
    },
    {
        "username": "Timbz",
        "content": "Hi family, \n\nPennybois is a foundation and home for me, especially with being a brand new trader, long term investor and getting my feet wet in the market. \n\nFor a long time (since 2021) and now, a Premium member as of a month ago. In reality, I should have joined premium a LONG time ago. BUT, its never too late.\n\nAnyhow, simply put, and in short, I want to give a massive level of GRATITUDE and CREDIT to @mrslp for helping ME and our team all become better, smarter and profitable going into ANY trade. \n\n***We have all learned tons of  GOLDEN knowledge, and the knowledge is still pouring into my bucket.***\n\nWhat have I(We) learned?\n\n> *The Fundamentals.....*\n\nSet a goal based on your portfolio size. Small gains = big wins.\n\nStudy the charts. Look at the levels. resistance and support, RSI, etc.\n\nStudy the company. Are the financials good? Upcoming earnings? Is the stock oversold? Is the stock undersold? This can help guide you to the decision and approach of your trade.\n\nKnow exactly how much you're going into each trade with, how much you're risking and when you're exiting, with either profits or losses. (SET YOUR TAKE PROIT and STOP LOSS LIMITS)\n\nAim for a percentage you can make on every trade, do that once, do it again, over and over until you can be CONSISTENT and evaluate from there. Clearly your strategy is working. \n\nAll in all, once you know what to do, do those things. I just explained them all.\n\nBUT, before ANYTHING - practice your strategy with FAKE money (this is best practice in my opinion and why paper trading is a massive massive benefit and point of levrage for new traders) LOSE fake money rather than LOSING your real hard earned money. Once you see your strategy works, apply that to your trade with REAL money.\n\nand finally...... \n\nDont trade with emotion.\nDont chase a trade.\nThere are plenty of trades out there. You wont miss your flight, another one will come.",
        "timestamp": "2024-09-26 15:20:53",
        "total_reactions": 241
    },
    {
        "username": "kennypenny",
        "content": "I’ve been in Penniebois for a few years. There’s several people that really stand out, and Lee is really one of them. His patience and wisdom are above and beyond. As myself, a mediocre trader at very best, he gives me someone to look up to and to look forward to hearing over the wire every chance I get. He’s always a gentleman, he never criticizes only coaches. And I’m glad he’s here. Thank you Mr. SLP.",
        "timestamp": "2024-09-24 13:59:27",
        "total_reactions": 88
    },
    {
        "username": "TnT0619",
        "content": "I have been with Pennybois since February of 2020, and am one of the original members!  I have seen many members come and go,  and many changes within the Discord.  The one thing that has remained a constant in my trading/investing journey has been Lee.  At the beginning, I knew nothing at all about trading, but trusted Lee's alerts from the get-go.  Not only is he remarkable at what he does, but he also genuinely cares.  The addition of the coaching programs was genius-and I feel very privileged and honored to learn from someone who is so exceptional at his craft. Lee has taught me so much along the way, and has made me a more confident person.  His style of teaching is very easy to follow and has made me excited to learn as much as I can!  Unfortunately, we started saving for retirement late in life,  but thanks to him, I know that someday my husband and I will be able to retire, and that no matter what,  I can always find a way to make some bread! (sorry-had to throw that in there 😉 )  Thanks for always being a great mentor, an amazing person, and for always being there! 💜",
        "timestamp": "2024-09-24 12:26:51",
        "total_reactions": 94
    },
    {
        "username": "Faa • rooq",
        "content": "I have been here as a premium member almost since I joined in early May 2024. Lee, aka MrSLP, aka MadMaverick.... was my very first mentor.  I didn't stay with him very long as he went on a little vacation.  To be fair, I'm a very strange fellow.  I like things a certain way.  I moved mentors.  I'm on my fourth or fifth now... and I'm back in his group as well. In the past 4 plus months, I've seen a little success followed by my implosion.  I went down 4K in a heartbeat.  Even though he was not my mentor at the time, he was the ONLY coaching mentor who checked in on me.  He was the lone voice when I was riding high, and advised me to take it easy. Apart from his great knowledge of the market, he is a great person.  I have the highest respect of a person of his calibre.  I, personally, didn't learn anything from him because I wasn't looking for what he was doing.  That's just me.  Other coaches did show me avenues that excited me.  Lee is instrumental in my life as a trader because he checks in on a trader... to see if they are OK.  Do they need a hug or a scolding.  I needed that.  I received it from him.  If you want to succeed, he's just one rung of a circle of coaches here that will get you to YOUR next level.  I can't recommend him enough.  So you might ask, if I'm not learning anything from him... why am I in his group? Well, i love to swing trade.  He's a master.  I check up on many things he posts as possible stocks to get into.  That's why I'm with Lee. I wouldn't be here today without him.  Thank you Lee for being there.",
        "timestamp": "2024-09-24 01:36:39",
        "total_reactions": 83
    },
    {
        "username": "thΞChag",
        "content": "Ethan knows his way around the market, especially the main big tech stocks. \nEthan has been able to teach me patience, to wait for my trade, planned ahead, and execute it like a surgeon.\nI still have a lot to learn, but in terms of option day trading, I owe him a great deal of gratitude for all he have shared with us so far.\nThis young men  is not only able to teach and execute trading strategies, he's able to share experience and wisdom with great psychology nuggets.",
        "timestamp": "2024-09-23 21:41:48",
        "total_reactions": 65
    },
    {
        "username": "Page307",
        "content": "I’ve been trading with Ethan for a couple of months now, and I’ve been incredibly impressed with his expertise and teaching ability. He has a unique way of breaking down complex trading concepts into digestible pieces, making it easy for even a beginner like myself to grasp.\n\nOne of the things I value most about Ethan is his real-time coaching. He guides us through trades step-by-step, explaining his thought process and the rationale behind each decision. This has been invaluable in helping me develop my own trading intuition.\n\nBeyond his technical skills, Ethan is also a great mentor. He’s always patient, supportive, and willing to answer any questions we have. I feel confident that with his guidance, I’m on the right path to becoming a successful trader.",
        "timestamp": "2024-09-23 20:27:45",
        "total_reactions": 11
    },
    {
        "username": "lordjellysneeze",
        "content": "Ethan is one of the best guys to trade with in the morning. He holds himself accountable and really explains his trades in the morning before he sets it up. The coaching is next level even when we are in the middle of a trade he gives solid play by plays so you feel comfortable taking profit or getting out if the trade goes the wrong way. Been in a couple other trading discords and only prefer this one because I’m not trying to trade all day. I want to be in and out and done with the market by 10am MST no matter what. Ethan explains why day traders need to find a strategy and stick to only that strategy and walk away for the day. It all makes sense if you just follow his direction. I use to take every trade I could afford and it worked against me until Ethan emphasized take a trade and walk away. Your win ratio will start to change. It had since. Couldn’t ask for a better mentor than Ethan because of how smooth he is with his information.\n\nEthan is one of a kind and is personable and won’t blame game he makes and over complicated system seem really straight forward and easy. Because it should be that easy.",
        "timestamp": "2024-09-23 20:25:48",
        "total_reactions": 8
    },
    {
        "username": "Vanz",
        "content": "I have had the pleasure of working with Ethan since May, and I can confidently say that he has been nothing short of exceptional. His expertise in trading has greatly enhanced my understanding of the market, as he has taught us crucial strategies such as how to identify optimal setups, size our trades appropriately, and effectively scale in and out of positions.\n\nEach week, we discover new concepts that we can immediately apply to our trading practices, making the learning experience both dynamic and enriching. Trading live with Ethan has been incredibly rewarding and his guidance has been invaluable. He approaches each trade with a clear set of criteria, ensuring that we only enter positions that align with our strategy, which significantly boosts our chances of profitability.\n\nWhat I appreciate most is Ethan’s ability to help us maintain our composure, especially during larger trades. This focus on discipline has been instrumental in maximizing my profits. Additionally, he is always responsive in our chat group, taking the time to answer questions and provide support when needed.\n\nOverall, my experience with Ethan has been fantastic, and I wholeheartedly recommend his coaching program to anyone looking to enhance their trading skills.",
        "timestamp": "2024-09-23 20:11:00",
        "total_reactions": 11
    },
    {
        "username": "SailorBrown",
        "content": "As a Lifetime member of Pennybois, I've found everything I need to succeed in my trading journey. They provide exceptional education that equipped me with the knowledge and confidence needed to navigate stocks, options, and crypto effortlessly. The staff's expertise and support have been invaluable, and I've gone from a novice to feeling fully equipped to tackle the market. Whether it's long-term investments or day trades, Pennybois covers it all, making it the go-to choice for anyone serious about trading success.",
        "timestamp": "2024-04-04 18:31:37",
        "total_reactions": 190
    },
    {
        "username": "Kiaris",
        "content": "I dipped my feet into the stock market for the first time in July. No plan, no strategy, just wanted to see what it was like. I very quickly lost 28% of my investment. I joined the free pennybois in September, and was immediately able to put the knowledge to use. I realized that I need to be extremely careful with the panic selling. After going Premium for a month I have gone from being down 28% to being within striking distance of being back to even. A huge part of that was the knowledge I gained from their Options education. but also just learning that it's ok to go at a slower pace. I see people say they make huge gains on SPY, and being new, I'm just not ready for that yet. Through Pookie's series and additional education, I've got a plan that I am slowly working on and don't have the sense of dread when I see a dip happening.",
        "timestamp": "2023-10-15 22:37:51",
        "total_reactions": 144
    },
    {
        "username": "Jrmiller78",
        "content": "I have been a member for a few months now, and every question or issue has been answered or taken care of promptly. I was skeptical at first as I am sure most were, but immediately after joining all that went away. These folks really care about each individual learning and succeeding. The best part I found is you can learn at your own pace, there's no pressure to do anything. If your having trouble grasping a certain concept they will work with you until they figure a way that you can understand. I am amazed how the site is ran and the community feel to it. Everyone is simply there to help each other and make money trading. It does not matter the size of your account or much trading you do, they treat everyone the same. I have asked many questions since joining and every single one was answered asap, and not once have I ever felt like I didn't belong due to my knowledge. Literally within the 1st few days the subscription fee had been covered by profits. There is so much that they offer I am still finding new things every day. It truly is our own little stock trading, and sometimes just hanging out club.. I just wish I would have pulled the trigger much sooner, a day trading without P.B in my opinion is a wasted and much more risky  day. Thank you Wonderful folks at P.B for providing the service it truly is amazing.",
        "timestamp": "2023-10-11 20:51:41",
        "total_reactions": 120
    },
    {
        "username": "Centenal_Black aka Doji Cat",
        "content": "Started with SNOW based on notifications and I have been trading 50 shares for the last couple of days with trailing stops. I’m sill learning but thanks to what I have learned in the premium membership I have stepped away from the trade and kept enough profit to pay for the premium membership for 4 months 😀. I’ve only been a premium member for a little over a month and my accounts have stopped bleeding and are on a steady recovery trend.",
        "timestamp": "2023-10-11 16:28:41",
        "total_reactions": 68
    },
    {
        "username": "Maestro3188",
        "content": "Hey everyone, I joined this group back in March very inexperienced in many ways and also very stressed in so many more ways especially with my trading. This place has provided me with a variety of tools in trading and in my personal life. This is an absolutely wonderful place to be providing you take the time to actually learn what education that the team provides and even the traders inside the community. 100% recommend to anyone who is thinking about getting into the stock market. Biggest thanks to all of PB and PBU you have been one of the shining lights in this world!!!",
        "timestamp": "2023-10-08 15:36:11",
        "total_reactions": 68
    },
    {
        "username": "Kseniya",
        "content": "Hello everyone, I would like to share my Experience in PBU, at first I was a memeber in the past and never really took advantage of this group. I decided to join recently the premium after really huge huge losses. I reached out to Nikki just end of September to guide me which directions to take as I was about to quit trading 😿 thinking it’s not for me. She found a time to talk to me over the phone. She sent me different resources classes 🙌 took her time to set my mind rather on smaller gains and not have FOMO. Everyone is super helpful when you ask questions. This is one of my best decisions. Just 10 days later I started taking small daily Gains and already recovered some of my losses. \nThanks a lot PBU🙌",
        "timestamp": "2023-10-06 20:58:52",
        "total_reactions": 35
    },
    {
        "username": "bDiddlyD",
        "content": "I guess I’ll start by saying thank you to the PB Family. Thank you for all of the support and teachings. I stumbled onto this community by accident back at the beginning of 2023. I had been losing money on silly meme stocks and crypto’s because I heard about the hype after the hype was over. Then I started hearing about how much money people can make trading stocks. I wanted to learn. Started googling how to learn stock market and PB happened to pop up. I took the chance and joined up. The first couple of months, I learned a little (not as much as I should have), didn’t take the advice of paper trading, and lost a lot of money. I almost quit. I wasn’t seeing the results I wanted and I was angry. But. I sat back and thought about everything. I realized I wasn’t holding myself accountable. I wasn’t really putting forth the effort of learning and applying what I’ve learned. I wasn’t paying attention to the psychology side of trading and I wasn’t paying attention to how my weaknesses were affecting my trading. Once I realized all of this, I was able to slow down, drop the expectation of hitting that one big stock run, and really see where I messed up. Now I’m starting to climb back out of the hole I’m in. I’m still not in the profit. But I’m a lot closer than I was a month ago. I set my goals, I set a ‘5 year’ plan. And without this community of amazing people, I wouldn’t have had a chance. I truly hope this helps someone that is looking to start, or even someone that might be experiencing the same things I did. I promise you’re not alone. No one wants to see anyone fail. Everyone wants to see success. This group is everything a new trader needs. From psychology, to basic fundamentals, to advanced technicals. I would love to see this community continue to grow. And I plan on sticking around for a long long time to see that growth.",
        "timestamp": "2023-08-20 17:16:24",
        "total_reactions": 56
    },
    {
        "username": "Devastator",
        "content": "What they taught me is that trading is about managing risks and emotions, while learning how to invest with patient confidence. That’s hard to do in our world of endless distractions, unless you have help - Learn from experts and educate yourself. Also, trading can be a very bad experience if you are always alone, and the community that Pennybois provides is the best part. They have educators, counselors, live streams, 1-1 training, a thriving discord and website, Crypto traders! and lots of content, and most of all education. I do want to mention that they help all levels of traders too, they do an excellent job of giving content to all levels of traders and investors. It took them a long time to win me over, but obviously I’m writing this testimony because this has been one of life’s good surprises for me, and I want more people to experience what they have to offer. No one should have to work their whole life away; and even though I don’t know you, I hope you find a way out of the rat race too.\nI’m still not a full-time trader, but dreams without goals are just dreams.",
        "timestamp": "2023-06-06 19:19:23",
        "total_reactions": 95
    },
    {
        "username": "Devastator",
        "content": "I’m writing this in the hopes of helping someone who dreams of being a trader or independently wealthy, perhaps my experiences can help you. I have a job, but I always dreamed of being self employed as a stock trader and building generational wealth. After years of losing money trading on Robinhood, I decided to get serious and gain some education on trading stocks.  It took reading many books on investing, before I realized that the only way to make it as a trader in the modern age was to have an edge over the many hedge funds and algorithms trying to work against me. Lucky for me, I stumbled upon the PennyBois Free Discord section, through a Facebook investing group I joined last year (Just joining that free discord saved me thousands of dollars). If you are still reading, remember this, the market is designed to steal your money – from the news articles to YouTube videos, to twitter. There is so much misinformation and manipulation, you aren’t at fault for losing money. \nThe only way to win is to educate yourself as to what is really happening, otherwise you are just gambling. Pennybois offers free trading courses and even provides some basic guidance for new traders for free. It will become obvious to everyone that they simply want people to thrive. I quickly realized I wanted more education and joined their premium service, and the content is top quality. I advise anyone who knows nothing about trading to join their free discord, there is so much content and support, it will amaze you. It has been a rough ride for me, and I am learning more every day, but the knowledge I have gained will last a lifetime. I also don’t trade alone anymore, and most of all, real time trading and training is what matters most to me, this market changes so quickly, you must stay on top of your investments and be prepared. After writing this, I’m really disappointed I didn’t reach out for help sooner, I could have saved a lot of money in the market.",
        "timestamp": "2023-06-06 19:19:06",
        "total_reactions": 0
    },
    {
        "username": "KyoCJ🐳",
        "content": "Well, my first testimonial for anything, bit nervous, but here it goes. I joined PB family for about 6 months now, When I started I  was looking to try out options trading. Of course I treated options like gambling, not knowing how to look at charts, support/resistance, 100% pure luck, and like gambling, it burned my account. Then I took the PBU course on my own time, spend time to look at analyst ideas and compare to what I have learned. It's definitely work, but it definitely pays off, Everyone is always so nice to help, doesn't matter what types of questions, there will always people answering. Their main concern is really to  help everyone grow. Thanks to PB, I'm definitely on the right path towards financial freedom, looking forward to a bright future with PB. ❤️ ❤️ ❤️ ❤️ ❤️ ❤️ ❤️",
        "timestamp": "2023-05-25 18:23:01",
        "total_reactions": 48
    },
    {
        "username": "Zach’sLizard🥳",
        "content": "I’m maybe guessing some of you want to to hear my story? But I’m still writing it lol! I have gone through most of these testimonials and I’m like, damm. How am i gonna top these? Or like, not even top but how can mine be different from everyone else’s? I’m realizing most our story’s are the same but it’s you that makes them unique sorta say you know? Because everyone has a story, and not everyone is the same. I have been trading since 2020 and I’ve found myself In PennyBois multiple times. Yes, i said it. Multiple times because i had left a few times because i had destroyed my account twice. I blindly followed trades for a year not knowing what i was doing and went off of emotions almost 100% of the time. I didn’t take the time to learn a plan and an exit strategy and in general had no clue what i was doing in the overall market and lost over $5k in Robinhood. I can say i realized that there was a ton of research and learning to be done and that it was gonna take some time but little did i know that there was actually a whole lot right in here in this discord. This discord is like a gold mind or the pot of gold at the end of the rainbow. There’s always tons of people to answer your questions if you’re ever in need. They’ve helped me a lot over the years and I can’t thank them enough. Truly this group, team and family we have here, is absolutely amazing and will always be the best of all time in my book as we push forward to help one another. I’m in a better place than what i was in, most definitely after watching over a ton of videos that they have posted and pinned here in the different channels. And i want to keep this short because Ik it’s looking like a paragraph or an essay but you’ll come to understand that “knowledge is the treasure of a wise man.” – William Penn. I still can’t thank PennyBois enough for all they’ve done and showed me. Thank you again so much!🙏🙌💪🏻🤙🏻🥹❤️\n🥳🥳🥳🥳🥳🥳🥳🥳🥳🥳🥳🥳🥳🥳🥳🥳",
        "timestamp": "2023-05-08 17:30:40",
        "total_reactions": 20
    },
    {
        "username": "🌴💛._MAX_.💛🌴",
        "content": "I've been with PB for a few months now. I have learned more in that time than I have in years of trading and taking losses. I've wrecked my account so many times was about to give up before I came here. I have been following Amma's plays and love the informative live streams! They whole PBU staff is amazing and truely wants to see their members succeed. The dedication and time the shotcallers have taken to create such an amazing environment is truely something special. I bought the year premium and have made what I payed back plus some. I'm excited to continue my journey of growth and learning to bring in an extra stream of revenue. Extra special shoutout tho to Amma! Your style of trading is exactly what I was looking for. Your so amazing and kind and always happy to answer questions and even walk through trades. I could go on and on about the benefits. If I could go back in time I would have joined PBU sooner. Not a moment of regret since taking the leap! Thank you again PBU for everything you guys do for us! <:the_way:754180893068755025>",
        "timestamp": "2023-05-01 19:33:03",
        "total_reactions": 24
    },
    {
        "username": "itsmissdani",
        "content": "I’ve been with PB now for just over two months and could absolutely not be happier. Like many people, I started off my trading journey with a rocky start, I very quickly lost a good chunk of my portfolio which was super disheartening. I was thankfully able to reassess which strategies I could follow best from the shotcallers here in PB and since have been able to make all of my money back + an extra 10% in the last month!  The admin are almost always available to help you with anything you need, they want you to succeed perhaps even more than you do sometimes. The team here is more of a family than anything and the wealth of knowledge you receive from them is worth the cost of premium alone even without the alerts!",
        "timestamp": "2023-04-16 15:32:52",
        "total_reactions": 24
    },
    {
        "username": "Moofu",
        "content": "Just to go even further for those who may be on the fence!\n\n - How would you rate your trading confidence and financial security before joining PennyBois Trading Community?\nTrading confidence was about a 3/10. Had a false sense of confidence that I had knowledge on how to read charts but beyond that, I knew my trading knowledge was no where near what it should be. Financial Security about a 5/10, I work a job now that is secure but doesn't pay great, it pays the bills but not much is left over to make us feel secure, enough. So that is what spurred me to make the PB jump because trading has always been a desired passion of mine because I would absolutely loveeee it if I could make this my full-time and my job now a part-time.\n\n - How has that changed since you joined?\nMy trading knowledge has shot through the roof after joining PB. From PBU to the YT and just the chat and listening to SLP, Amma, Quench and everybody, it has really opened my mind to the world of trading. Financial security I would say would be a bump from a 5 to a 6/10. Very positive, but not a huge bump because I am still playing with a small account. Just being honest, I started with $150 in the account and now its grown to $604 yesterday. My next goals are $1k, $1.5k, 3K, then $5k and once I hit there, my security will feel better and my willingness to play with more money and bigger boy trades will be there!\n\n - What would you tell a new trader that was on the fence about joining?\n\"You miss 100% of the shots you don't take\", take the leap and you will thank yourself! If anything, try it for just one month and you will see the benefits. If you apply yourself, learn from PBU and all of the learning materials offered, you will make your money back with ease!",
        "timestamp": "2023-03-22 19:31:00",
        "total_reactions": 15
    },
    {
        "username": "Moofu",
        "content": "The family here at PB is awesome! The team is wonderful and are willing to help you learn and become a knowledgeable trader. The community is huge and everyone is welcoming and a blast to talk to. Myself, I started with a small account to only play with what I can afford to lose and take time to really learn and take advantage of PBU, but in not even 3 MONTHS, I have tripled my account from the help of Pennybois and their alerts! I look forward to every trading day and hope to be a lifetime member soon!",
        "timestamp": "2023-03-22 15:54:58",
        "total_reactions": 12
    },
    {
        "username": "bill_1031",
        "content": "The program is very straight forward, follow directions, learn from the professionals, make money, repeat. I got back into trading a little while ago and was pleased to see I had broken or simply fallen out of the bad habits I accrued when trading previously. But I was still barely making money, 3% here, 5% there, then a bad trade would wipe out all my progress… I finally caved, signed up for premium, and couldn’t be happier with the results. I’ve added 10% to my portfolio daily and have already made more than I paid to be a part of premium. If you’re on the fence about premium, just do it, it’s absolutely worth it. 💰💸",
        "timestamp": "2023-03-08 23:45:57",
        "total_reactions": 15
    },
    {
        "username": "Tic - Breezy (Lets Gooooo)",
        "content": "I'm not going to give you a story about my trading journey as its similar to everyone else  first you suck  and that's either the end or a new beginning you either quit or become obsessed. I've been part of this group for going on two year's  most everyone that see's these or reads them Knows about the amount of knowledge tucked away in here.  I don't care what your style or specialty someone's doing it and doing it well. I have only joined up in two other discords and all it was about is shit talking and guys trying to get paid  for advise or trading tips, there was no sense of community or team. needless to say that didn't last long  When i joined this one I quickly found out that Regardless of status in this group everyone is on the same page, Getting knowledge, sharing  help, getting consistently paid by the market...  The amount of support and encouragement is off the charts.  I could give you a hundred examples but i would end by saying come over and try it.. It don't cost a thing  but some time, ask some questions tool around and see for your self..    we have nothing to hide there's plenty of money to go around  if your struggling to do this and we all do  there is certainly a tool in this bag to fix it.",
        "timestamp": "2023-01-28 13:12:03",
        "total_reactions": 45
    },
    {
        "username": "katelyn7099",
        "content": "I had dabbled in stocks for several years. I’ve always been curious about it and wanted to learn. However, when I started with stocks I was just going in blind. I would try to search and figure out things, but it seemed to only confuse me more. I had saw ads about this group, but I wasn’t about to waste my money on something I had no idea if it was legit or not. Then a friend of mine started posting about how he was doing with his stocks. CaptainOfConsistency asked if I had ever done options. Ummm absolutely not I have no idea what that is. So we talked for awhile about them. I learned a lot from him, but he told me about this group. Finally I gave in and said I would give it a shot. I’m so glad I gave in and chose to do something for myself for once. I’m constantly going back and looking at classes to see what I may have missed the last time. I try to watch the streams as much as I can. I work full time and I’m a mom of two. It’s not always easy, but I refuse to give up. \n I have completely blew my account several times trying to learn. I keep getting better, but I know I still have a lot to learn and adjust. I’m constantly paper trading Options I choose for myself and the shot callers as well. Looking at charts, choosing an option, and then watching the chart and how they react differently. \nThe live streams where I am watching them chart and getting to hear them explain help me the most. I’m so thankful for this group. I get frustrated with options when I’m not doing something right, but can’t put my finger on what it is. I take breaks from options when I get like that because nothing will go my way till I learn and figure out what I’m doing wrong. I go back to equities and do those for awhile. I’m always in the back shadows of this group(thanks anxiety), but constantly online and looking. O.G.Nikki is a blessing to me. She’s so patient and kind with me. I say reach out to her and try it for two months at least! Take it slow and learn is best!",
        "timestamp": "2023-01-26 14:15:06",
        "total_reactions": 25
    },
    {
        "username": "Portgas D Ace",
        "content": "A buddy I used to work with actually got me into trading and I saw pennybois ad on facebook and was very interested. I’ve been apart of pennybois for about 3 years or so and it has been life changing the people here help you learn not just about stocks and options but about who you are as a person. It’s not just the shotcallers also but others who know exactly how your feeling after losing a trade or having high anxiety before getting into one because they’ve been there and done that and help you learn to not do those mistakes again. I’ve learned so much about myself from joining pennybois and watching ammas livestreams and listening to what mr.slp and swingingbull talk about and want to continue to learn because my goal is to do this full time! I still have my bad days but every trader in the world does but that bad day is just a learning experience for you and as long as you don’t give up on yourself just because of a bad day or week and having faith and believing in yourself is a step in the right direction which is one of the biggest things I’ve learned and am still learning about myself. If your a free member and have been having doubts about this discord group I highly suggest joining you won’t find another group like this one!",
        "timestamp": "2023-01-26 01:21:30",
        "total_reactions": 22
    },
    {
        "username": "Big Daddy Mouse",
        "content": "All I can say is JOIN! I saw this discord advertised on many stock pages. Working hard on my own I had built a 3.2 million dollar account only to have it nuked when trusting it to a financial advisor. I knew I needed help so with my last bit of money 50k I joined. My very first trade with PENNYBOIS netted me a 60k profit. I watched the videos in the PBU and am learning every day. not every trade is a winner but what they have taught me is minimizing my losses and making me more profitable in the long run. I cannot say enough good things about PENNYBOIS. A few more trades and I will be buying the lifetime membership. Joining is already paying dividends 😉",
        "timestamp": "2023-01-13 22:54:09",
        "total_reactions": 45
    },
    {
        "username": "marlon1234",
        "content": "JOIN, JOIN, JOIN!!! I have NEVER written a testimonial or provided feedback for a service or company. However, I had to do it for  Pennybois discord! This discord is the cheat code for financial independence. If you follow their trades, it is IMPOSSIBLE not to make money. I will not say what I started with, but it was under 5K. The thing is,  I signed up for their two week trial about a week ago and already I made the yearly membership fee several times over! JOINING PENNYBOIS IS A NO BRAINER!!! No matter what you start with, you will make it back in the first week IF you follow what they say. YOU CAN THANK ME LATER!",
        "timestamp": "2023-01-13 22:25:11",
        "total_reactions": 23
    },
    {
        "username": "k15goose",
        "content": "Hey guys, I thought I'd finally give my testimonial. I've been watching this group for more than a year and finally pulled the trigger on some options contracts last week and made a small profit! I was nervous for the longest time and for no reason! I'm a newbie to trading options so I definitely like to take things slow but I'm so excited to finally get going and anxious to make those high % profits I see everyone doing everyday. \n\nThe culture is amazing, the admin are friendly and knowledgeable, and everyone wants to help you succeed. Also, I'm 99% sure that every shotcaller plays what they alert which is so different from every other group I've ever heard of. \n\nIf you're on the fence about joining PB, don't be! Just subscribe and get started! I put it off for way too long and wish I hadn't waited as long as I did. I gotta give a special thanks to Nikki. She helped me so much from the very beginning to setting me up as a lifetime member!",
        "timestamp": "2022-12-13 00:25:23",
        "total_reactions": 33
    },
    {
        "username": "Kiryuu1",
        "content": "I started with crypto trading and was doing well in that and decided to try my hands at stocks. Without any guidance I went and tried to learn it as I go. That was a mistake, not knowing how things worked especially in options, not doing due diligence, not protecting profits costed me a lot. I decided I needed help somewhere and ended up here after trying a few others. At this point I was down 18k and at first I was making use of PBU but somewhere I slacked and somehow went back to my old habits. I at this time was on a roller coaster. I probably should of done the 1 on 1 mentor but instead I just took a break for a few months. Came back here again because I saw everyone's success and downfall but the group continuously was supportive. I saved a bit more and started with 3k and went slow. On the first day back I made up the 3 month sub. A month later they offered a great 1 year deal and I made that within a week plus more. I definitely changed my style to protect profits and stop trading so much on emotions. I do this on the side for fun and this has been a fun group even if I barely talk on here. I will say everyone here has been awesome and the education here is priceless. At least to say I am up 400% since I rejoined and close to recovering what I lost only in a few months. I'm very thankful to Amy and Mr SLP as I follow them the most. Once in awhile I'll take Patricks lotto plays and when he hits its insane. I don't see many groups hit as much of their option plays like these guys. I've been in 5 groups. Small gains but nothing compared to these guys.",
        "timestamp": "2022-11-30 21:43:16",
        "total_reactions": 17
    },
    {
        "username": "ufo",
        "content": "I started my trading journey in 2021 following a guy who posted phenomenal day trade hotlists everyday. I did pretty good off his plays, but really had no idea what I was doing, just watch for it to pop, buy, and get out quick. Sadly he left the trading game and I was without a mentor. I floundered around and made some trades here and there, but could never replicate the success. Fast forward to a few months ago and I was invited here to the discord group. I joined for free and quickly saw that the free trade notifications where legit, and successful. After reading around the discord I found that this was exactly what I was looking for. I decided to make an investment in myself and my future and bought a premium membership for a year. Let me just say that I am far beyond satisfied with my decision and would not change it. I have learned so much here in a few short months, and everyday I learn more. The PBU university is great, it teaches everything from psychology to indicators, risk management, and so much more. The premium alerts in and of themselves are well worth the investment in premium with alerts for day trades, swing trades, otc, crypto, retirement plays, and of course all the juicy options plays you could ever desire. I'm now on track to make significantly more than my investment for a year of premium service. What I consider the real value though is the knowledge I am gaining. Instead of just taking the alerts blindly I now understand how to analyze the chart, use the indicators, and when the good times are to both enter and exit the trade. Through this amazing group I am learning to be a competent trader and investor, and the knowledge I am gaining will be able to help me make trades to supplement my income for the rest of my life. I'm not looking to get rich quick, what I am looking for I have found. A place to help me grow my knowledge and support me in my passion and pursuit of investing and trading.",
        "timestamp": "2022-11-27 02:09:31",
        "total_reactions": 19
    },
    {
        "username": "BuckWild",
        "content": "I started trading in 2020 with a group of friends at work. We began to trade energy companies we were familiar with and one day a coworker joined our group and told me about PennyBois, this super exclusive group of traders that could only be joined by invite (this is literally what he told me). So, I had to join this group to see what the hype was about. I jumped into the free section of PB in Sept 2020. The free classes and live streams were great! I learned quickly that PB was about trading responsibly. PB is a group of professionals that are committed to help the every day person succeed in the stock market and learn as much as they want to at their own pace. I was hooked and really enjoyed the free section. Then one night I won a raffle for one month free of Premium. Wow is all I can say. I could not believe I stayed in the free section for so long! I went through PBU, wrote my trading plan and got to work. I earned plenty to pay for my premium membership. Now here I am and have done so well. I started thinking about the cost of premium and the profits I have made which far exceed the cost for lifetime membership. That coupled with the fact I can’t say enough about the PB staff and the amazing culture of caring about people and helping anyone to succeed in the market and in many other aspects of life. Quench pours his life out to helping others with habits, hang-ups, and addictions. Each shot caller personally cares about every member doing well. The support staff are amazing. So, why would I not join lifetime membership? There is no reason why not. So, I did it, and just like when I joined premium, wow! I now have access to all that PB has to offer and it already has profited me greatly. This was an easy, no brainer investment. Everyone in this community is committed to one another’s success because of the culture that was intentionally created. What a great community to be a part of. And the best part is, everyone is invited! Thank you Pennybois!!!",
        "timestamp": "2022-11-11 19:02:31",
        "total_reactions": 25
    },
    {
        "username": "Jefe",
        "content": "I started trading in February 2020. Started off pretty good. I was making what I thought were good gains. The market came tumbling down and due to my negligence and lack of a solid trading plan I went from green to down 70 percent all time. I wanted to \"keep playing the game\" so I fomo'd a handful of plays from WSB Facebook page and absolutely got hammered... I wanted to quit and just give up but I seen someone advertise the pennybois group a few months ago. I figured it couldn't get much worse so I gave it a try. My first play from the group was one that PP posted. I forgot the play but it made me a few hundred dollars in a matter of minutes. I was super impressed and stoked. I kept sticking with the group and developed my own trading plan. I found what works for me and what doesn't. I am without a doubt still a newbie to this game with so much to learn but with the help and knowledge of this group I have improved my account 75 percent in the last month. I'm absolutely ecstatic about that and I know it's all up from here. Everyone in this group is helpful and are eager to help you just like they helped me. Thank you to everyone who made this group possible and thank you for continuing to kill it and spread knowledge. I sincerely wouldn't be where I am without you guys and gals. Y'all truly are the best! Have a green day everyone ❤️",
        "timestamp": "2022-11-10 15:22:09",
        "total_reactions": 27
    },
    {
        "username": "north8869",
        "content": "I started trading in January 2020 and, like everyone else, I very quickly grew my account. However I had some difficulties come up in my personal life and I lost it all. I was so close to quitting trading. But then I found Pennybois.\n\nOver the last couple of years, I joined many different groups and they all unfortunately led me to lose more money than gain. Once I found out about Pennybois, I joined right away. At first I was skeptical, asking myself “what am I doing? Haven’t I lost enough money already?” So I canceled my membership and got a refund. To my surprise, they were nice enough to contact me personally and ask me to give them a another chance after explaining more about the group to me. Boy, I am so glad I said “YES” and gave them another chance. This group is nothing like anything I’ve tried before. They are more like a family than just a trading group. They care about others so much and for the first time I have actually learned how to trade rather than just react to an alert without knowing what is going on. It is the first group where as soon as I ask a question I get an answer right away, no matter what. Everyone in this group is amazing, but I have to give a shout out to Mr SLP, Amy, Nikki, Mr PookiesRevenge, Patrick and so many others who made this group even more special. I had made a promise to my husband, who unfortunately was recently diagnosed with a terminal disease, that I was going to make this work, and this group has made it happen. Thank you Pennybois! ❤️❤️",
        "timestamp": "2022-10-26 22:05:22",
        "total_reactions": 39
    },
    {
        "username": "DrMalpractice",
        "content": "Been a PennyBois member for over 2 years.  First and foremost this place is a Family. A community. A home from home. Wrap this up with a top class trading education and some hotter than habanero alerts and you have yourself the secret sauce of trading groups. Never leaving! Come join us. Don’t trust it? I was nervous too. Just hit the FREE SECTION and see with your own eyes. You won’t regret it. See you there. ❤️",
        "timestamp": "2022-10-13 20:43:49",
        "total_reactions": 26
    },
    {
        "username": "Scrotus McDingle",
        "content": "So, I had no idea what I was signing up for when I started with PB around two years ago. Was very skeptical at first. Started with the free side and that didn't last long after seeing the alerts and the consistent success the shot callers were posting. Then I joined premium and realized I really have no idea what the hell I'm doing and while everyone else was posting gains I still manged to be rather unsuccessful. Now this is about the time PBU was rolled out in beta form so I jumped on the opportunity of the free education. Then I went through the first actual class of PBU. Enjoyed both of them and in those courses is when I started to get an idea of what this group was all about. Got the sense of community and family from the instructor What the duck as well as from the rest of the individuals in the class. We were all learning and growing and helping each other out. I was realizing that all these people in this group genuinely care and wanted to see everyone else do better and be successful in this. Now after being here for the time I already have and knowing that I had no plans of going anywhere when they offered the lifetime membership it only made sense. Looking forward to see what Big quench and the admins have in store for us all! So a huge shout out to all the shot callers, admins, moderators and everyone else that works behind the scenes to continue to make this already awesome place grow and change for the better everyday. Thank you Pennybois!",
        "timestamp": "2022-10-10 22:31:01",
        "total_reactions": 32
    },
    {
        "username": "BErt",
        "content": "in may-aug i went from 300-1000 and because my account had a liquidation warning on it, i opened a new account and from aug-now i transferred 1047 to my port, currently sitting just above 1,300 🙂",
        "timestamp": "2022-10-10 21:49:20",
        "total_reactions": 9
    },
    {
        "username": "BErt",
        "content": "i dont know where to begin because everyone and they're mom will be able to see this so ill just spill the whole can of beans, I'm an open book. I've nuked my account three times and i never blamed myself always the market or some random non existant entity, I never gave up tho, i was just oblivious because of my own ignorance. PennyBois has saved me. The amount of knowledge I've obtained cant be compared, seriously you will learn everything you will need to know. I started the first few months just doing PBU and absorbing all the knowledge i could from shotcallers and i dont regret it. I've learned so much, charting, indicators, risk to reward, etc i could go on.  So far, from the things ive learned, ive been able to gain somewhere in the ballpark of 200% in ab three months, another 100% is from the shotcallers help/alerts. I wouldnt want to be anywhere else but PennyBois, its a family, i finally feel accepted by a group of smart people who are actively trying to help people. Im so happy i found pennybois<:SCWLSD:750768558975484065>",
        "timestamp": "2022-10-10 21:46:26",
        "total_reactions": 22
    },
    {
        "username": "Gator2020",
        "content": "Are you new to trading?  Have the desire to learn and put in the work? The Pennybois trading community provides the best staff, shot callers, and educational material to help you grow your trading skills and portfolio. No reason to be hesitant or shy here.  The staff have cultivated the most supportive culture to help you succeed and grow, and important to me, trolls and negativity are not tolerated.  Members try to help each other and staff are very responsive to any individual questions or inquiries.  Multiple live trading sessions are held weekly. My trading journey has evolved from true beginner over a year ago, to now being able to confidently chart and play Scalps, Day Trades, and Swings , whether equities, options or crypto.  I have now learned how to trade, trading psychology awareness, scaling in and out, identifying less risky trade entry/exits, risk/rewards and more importantly, what NOT to do. Without PB, I would have blown up my account within a few months of starting. The resources are here to reach your goals, whether starting with a small or large account. Only limitations are up to you.  Slow and steady growth, compound gains to the moon!",
        "timestamp": "2022-10-10 21:45:33",
        "total_reactions": 12
    },
    {
        "username": "SAIL",
        "content": "Pennybois saved my life, i was down 5000$ on robinhood with my poor choices that I made. I learned from Nikki that you shouldn't be greedy with the market and go for a low goal of a percentage every week, and look, I turned my losses slowly into gains. Now I'm up 9% in the past 2 weeks and up almost 4% this week. Which is great. I went all the way down and lost a lot in the process, but now that I learned the best way to trade things have changed and it really has impacted me and my trading journey. Thank you to @o.g.nikki for being there every step of the way and helping me when I needed it. Without this server I would had quit trading stocks for good. But I'm turning it around. Thank you pennybois 🙏 Make wise choices and don't screw up like I did in the beginning, take the time to learn!",
        "timestamp": "2022-09-12 20:06:45",
        "total_reactions": 65
    },
    {
        "username": "Mattster42",
        "content": "I am so blessed to have found Pennybois. I traded on my own for years. Sometimes very successfully but more often than not, I would give it all right back. What **WE** are building here at Pennybois is truly innovative. We are building a community for the little guy. But this place is more than an outlet to distribute killer alerts. They ABSOLUTELY do that, but I have been in other groups that boasted and provided big gains. ***Though this place has developed the BEST day trading shot-calling group out there. The gains we are seeing are off the flippin charts consistent!!*** This place for me is more than a top notch trading education and mindset center. They ABSOLUTELY provide that, but let's face it, YouTube is chock full of educational channels and channels helping you to work on your mindset. ***Though I am not sure I have ever seen a course with as much technical / mindset / planning / strategy in one spot!!*** So what is so special about Pennybois? There is a fellowship here I've not found anywhere else. You can ask any one of the shot-callers or admins and they will set aside time to work with you one-on-one. Seriously. They have helped me uncover some of the things that have held me back for ages that I never knew were there. They support this community and ***anyone and everyone*** who is willing to put in the effort and ask for help.\n\nAfter years of struggling, I feel I am finally on a path to financial freedom and eventually generational wealth. I learned more about myself here than I thought I would, and that has made all the difference. Thanks for everything! Much Love!",
        "timestamp": "2022-09-03 22:09:01",
        "total_reactions": 60
    },
    {
        "username": "AgentPenguin",
        "content": "I must say Pennybois has been the best thing I have accidentally stumbled upon. Although work can be hectic, the alerts here have helped me to pick a few tickers to observe rather than having to do everything by myself. There's all sorts of alerts to cater to any type of traders. They even have some watchlists for those that would like some preparation! The shotcallers/ admins here help create an exemplary community for trading and creating a family within. There's always plenty of opportunities to jump into a day trade! If you don't know how to day trade- fret not, there are plenty of people in the community to help along the way! I've made myself home here forever. Much love to everyone here. Let's learn and make some money! <:cuteheart:942826914769416273> <a:money_bag:865379673616416768>",
        "timestamp": "2022-09-03 02:41:01",
        "total_reactions": 22
    },
    {
        "username": "Shushy",
        "content": "Everything I know about trading I learned from Pennybois and\nPennybois University. These trainers and shot callers work tirelessly to deliver solid alerts and give us the education to know how to play them. I've got my stocks that I like trading, and ones I'm in for the long term. But what I really like to do while I'm holding those stocks is day trading options. These options alerts are straight 🔥FIRAH!!!🔥\n Especially the day trade alerts. When I was only trading stocks, having a 100% runner was a huge deal! But with the Pennybois options shot callers it seems to be a regular thing. \nPlenty of times on red market days the only thing keeping my portfolios in the green was options day trades.",
        "timestamp": "2022-09-02 20:37:57",
        "total_reactions": 21
    },
    {
        "username": "BigDaddyNHM",
        "content": "I been here for a while and started off with longer trades, but I love day trading here at Pennybois! I can pop in for a few minutes while on break or a conference call and usually catch a fast trade without having to babysit it all day. Often they keep on running after I profit.  The alerters are so on fire even the swing trades sometimes turn into day trades. I'm never leaving!",
        "timestamp": "2022-09-02 20:14:40",
        "total_reactions": 17
    },
    {
        "username": "jonb3739",
        "content": "Been on pennybois for 3 months and can honestly say im impressed. I have learned alot through this group and will only continue to grow. Sometimes trading psychology gets the best of me but im slowly identifying my faults and strengths thamks to PBU. Just this week had a 100% and 250% trade. Thanks to pennybois. Ill continue to follow pennybois!!! 🔥 🔥 🔥",
        "timestamp": "2022-09-02 02:08:00",
        "total_reactions": 27
    },
    {
        "username": "csmith5522",
        "content": "Just want to give a shout out to all the penny bois and gals here who have been working everyday to make sure we stay informed and stay on top! Before I came here I had lost about 78% of my account, but now with the help of my mentors here at pennybois I have began seeing consistent profits. So once again, thank you for giving me proper education and showing me how to be a successful trader.",
        "timestamp": "2022-08-17 21:26:00",
        "total_reactions": 49
    },
    {
        "username": "skydivingfool",
        "content": "I really just wanted to take a minute and thank this community, especially OG Nikki and L.T. I started my journey in trading months ago. I got lucky, made some money, and then I lost more then I like to admit or say out loud. It was great at the start when I was making money (knowing now this was just being lucky), but once I lost way too much money I got so upset that I lost interest. I work 50 hours a week in my corporate position, and recent jumped into a food truck with my family, so I’m working 7 days a week. Bills were getting tight so I decided to tuck my tail in between my legs and cancel my subscription. That’s when Nikki reached out to me. She listened to what I had to say, even though my paraphrasing wasn’t 100% accurate, she didn’t call me out on it, but she stated some very true statements. She then introduced me to L.T. Immediately I felt like they actually cared, and I wasn’t just another membership. They both made me feel not only comfortable, but confident. After some good conversations, I decided to give it one more chance. I signed up for the year, told Nikki this was my last hooray, and if it didn’t work out I would throw this account away. I feel like they both understood my frustration and we talked through what might have gone wrong. Well let me tell you, it was me 1000%. I went back into PBU and started over, but this time I was absorbing the information. I believe after our conversations, I realized what was hurting me. It was my emotions, and not really understanding my risk management. Watching everyone celebrating HUGE wins, I wanted that, and I went all in, and it went south. After starting PBU all over again, I was able to control my emotions, and I’m happy to say, after 1 week I’m up 50%!!!! Paid for my year membership, within a week! You do not have to play every call! 😂 learned this the hard way. I have slowed down, do more DD, and it paid in huge dividends this week. I can’t thank them enough for not letting me just leave.",
        "timestamp": "2022-08-04 00:31:16",
        "total_reactions": 88
    },
    {
        "username": "WardogSC",
        "content": "Hey my PBU peeps I just wanted to share my experience and thoughts because I’ve had a bit of a different experience than most, at least I think.  I was referred to PB by a friend (I won’t call her out don’t want to embarrass anyone🤣🤣🤣🤦‍♂️🤦‍♂️🤦‍♂️) I had a bit of trading experience but only enough to be dangerous.  I had gotten involved in Trading due to the AMC and GME WSBs phenomenon and did pretty well.  Problem was I wanted to become a better, more diversified trader.  I also wanted to understand options, charting, and indicators better.  I went through and graduated PBU and to be honest I’ve probably forgotten most of the info since it was over a year ago and I have memory problems.  With the help of the amazing staff I came up with a trading plan (that I do still struggle to stick to and find myself reverting back to it). I was able to find a combination of indicators that assist me in identifying trends and making my entry and exit points, as well as becoming better using the charting tools.  Another aspect that I didn’t realize I was missing was additional resources like investing.com app.  It’s like my Bible for trading.  It has news, futures, commodities, all the important financial releases like CPI, GDP, Unemployment, etc. all in one easy calendar so I know what his happening that may drive the economy and markets each day and week.  All of those factors have made me a much more effective trader and when I lose I lose smaller and I’m winning more consistently.\n\nOne thing unique to my story is that I used my gains as a means to pay for my divorce last year.  It completely took away all of my trading ability but had to be done because I had to come up with about $27,000.  $16,000 had been made by following the alerts and instructions I received from PB’s.  I then had to stop trading because I had to focus on my health and my kids that I had full custody of and was homeschooling while working from home.  I kept checking in on the discord and tried to come back at one point and was treated like I had never left.  The staff made me feel like I belonged.  However I wasn’t ready and life intervened again and I had to take another break.\n\nWell a month ago I received a check from an old 401K that I didn’t know about and it was enough to purchase a 90 day premium membership and have $$700 left to invest.  I put $500 into a new Webull account, and the other $200 I bought some crypto ( I mean these prices come on). The staff told me about the military channel and got me hooked up on there, and then got me signed up again and I think at one point there were like 3 or 4 different staff members making sure I got all the help I needed.  Once again just making me feel important and like I belonged.  I will say trying to sift through all of the new shot callers alerts has been monumentous but I was able to find a few that looked to my liking, along with a few of my own and I took my initial $500 and in just a week and a half I have gained over 30% and now have $680 in my account.  My first goal is $1000 which I hope to smash by the end of August.\n\nWhat I want to leave you with is this, if you do the work the program works, if you are participating in the community it becomes like a second family, and if you feel like you’re doing it wrong, ask for help because everything can be fixed and anyone can be a great trader and MAKE SOME BREAD.\n\nThank you to the entire staff, but the ones that went above and beyond for me were @pookiesrevenge @metamattt @ammajamma @mrslp and last but not least @o.g.nikki \nI personally interacted with all of you the most out of any other staff members and even played that imposter game and enjoyed some laughs together.  I know there are more I’m forgetting but hey my memory is shit.  \n\nI can’t afford the lifetime membership right now but I’m definitely a Pennybois supporter for life!",
        "timestamp": "2022-08-03 21:15:43",
        "total_reactions": 34
    },
    {
        "username": "Anil SVR",
        "content": "Today I had a great day where I interacted with Ammajamma and JamesLegand during my 1-1 . I have explained them about my trading journey and my understanding before taking any trades. They both were so patient and corrected my thought process before taking the trades. Also shared some important tool combinations for taking the trades with much more conformation. I am glad and would like to have few more 1-1s with them for my betterment. Thank you",
        "timestamp": "2022-07-05 22:18:54",
        "total_reactions": 43
    },
    {
        "username": "everbeek818",
        "content": "Hey real quick here. I can't thank this community enough. I started here back in December and started with $400. I went through PBU. The education was phenomenal. Papertraded for about 2 months then gradually grew it to about 2 grand!! All while working a 8 to 5 full time job and having a newborn.  I never really seen myself as a person messing with the stock market yet alone as a daytrader and that's all thanks to pennybois and the community of people in it. I have made friends from the discord that I talk to everyday just about and to me atleast that is more valuable then any money. The money made is nice also lol. There is no backlash in this community and there is never a dumb question asked. I'm glad I came across pennybois and decided to give it a shot wouldnt want to be anywhere else. Remember anything you could put your mind to you could accomplish. It doesn't matter how many times you get knocked down it matters that you get back up and give it your all and don't give up!!!!!",
        "timestamp": "2022-06-25 00:33:09",
        "total_reactions": 28
    },
    {
        "username": "eddieeex4",
        "content": "I just want to say thank you to PBU for teaching me how to be a trader and not a gambler. \nI started investing in February 2022 , and found PBU around the end of March. When I first joined I was just taking alerts without confirmation from myself but I did gain money, but there was one point where I got cocky and didn’t put stop losses and ended up losing a good amount and even having my contracts expire worthless. So I took a break for like couple weeks then told my self “I’m actually going to learn and not just take alerts cause that’s not trading” so I took the classes and even watched a couple videos on YouTube for charting, and when I felt comfortable enough I just started paper trading for like a month. When I felt I was comfortable enough to trade I made some trades gaining little by little and kept learning and studying. Now I try to limit my self to taking alerts from the alerters and making my own trades, and good to say that it’s working out better than I expected it. Sometimes I take losses but hey you can’t win all of them, but ever since making my own trades I only lost like 2 trades. The thing that helped me out the most was the trading psychology classes because of that I don’t FOMO I don’t gamble and I don’t regret anything even if I lose. Also the community here is so nice and friendly I really appreciate everyone. \nOne more thing I want to thank @o.g.nikki for always being there when I needed help, would always answer with the easiest understandable answer, also just a nice person to talk to.",
        "timestamp": "2022-06-23 23:22:32",
        "total_reactions": 34
    },
    {
        "username": "George4Man32",
        "content": "Truth time: Hi, I'm Chandler(aka George4man) I used to be a liar. I lied to myself and others to feel successful. I lied to try and gain \"fame\" in pennybois. Funny right? Wrong, I had nobody to impress but myself and only myself. I was successful earlier this year when I took my account from $2500 to $6k in weeks. And then I got greedy and turned 6k into $68 in days. Posted all my gains for 5-10% on the way down to look cool. \n\nHere's what's actually cool. Turning $68 into $2,670 in 8 weeks almost. Now that's the truth. With PBU, and the shot callers help, I've actually made money and on the path to becoming very successful. I've developed a plan here. I've learned about accepting losses at small percentages. Most importantly I've learned how to chart and take plays without their help. \n\nLadies and gentlemen, with this group I was able to help my struggling dad with $1,000 for father's day because of this group. Education first, profits second. And it didn't hurt me. \n\nIf you're lying to yourself and others, freaking stop it. Who's it really helping? Nobody. Transparency is key, and these leaders in this group will welcome it for your benefit. \n\nI said this before while losing a lot of money, but it means just as much when I'm profiting, it's not if, it's when. And when I'm financially free and not a cog in a machine for corporate America, I will share wealth, and knowledge. \n\nBe selfish in wealth until you don't have to be, but always be selfless in knowledge.",
        "timestamp": "2022-06-23 01:30:47",
        "total_reactions": 94
    },
    {
        "username": "Swelington",
        "content": "Hello everyone, I would like to share my Experience in PBU, I started in March and I was learning very slowly until I found PBU, They taught me almost everything I know, They are defentily the best discord to learn in for the reason they are very professional and is very respectful too all members in PBU, Thanks too them I can see profits on my account and not going red on all trades I take anymore, They helped me with things I thought I would never understand  and got The oppertunites too help others.\n\nThis is one of my best desictions I have made at only age 16 and will never regret it!\n\nThis could be one of your best desictions  you have made when you are looking for education and support!\n\nThanks a lot PBU",
        "timestamp": "2022-06-22 22:28:57",
        "total_reactions": 22
    },
    {
        "username": "ImMrBullDops",
        "content": "I don’t know what to say that would actually give this community the justice it deserves. It’s a fundamental and emotional education platform that really teaches you how to trade in a way that works for you. It’s a family. I work 60 hours a week in a factory and still managed to trade with this community so it’s not even like you have to dedicate yourself all the time. They work with all kinds of individuals and situations. My first three months I went through PBU (their free education program when signing up for alerts) and learned so much about trading and myself. I was profitable 100% in those three months. I used that to give my new step daughters a beautiful vacation and Christmas. I found out that I was having a child and had so many life changes hit me at once I stepped away from trading. I remembered how badly I wanted to work towards being a guide to return the knowledge the same way the current guides did for me. I thought about the financial freedom I wanted to gain to get away from this grueling and exhausting work lifestyle so I can eventually trade full time and become a lifetime member of pennybois. It’s a small account, but every day is a step closer and here I am; not even 30 days in; and I’m back up 191%. Thank you to pennybois. Thank you to @ammajamma @mrslp @pookiesrevenge @bigquench @jameslegendss for everything that you do. And a big thank you to @o.g.nikki for pulling me back to this community.",
        "timestamp": "2022-06-09 17:01:00",
        "total_reactions": 67
    },
    {
        "username": "ErickGuzman",
        "content": "BEST DISCORD AROUND!!! This discord has given me the knowledge to begin to journey to financial freedom. Everyone here wants you to be better and succeed. The people are super friendly and very knowledgeable. If you ever needed something answered they are there to do that. Someone is always waiting to make sure you understand everything. Looking forward to my journey and can’t wait to extend my time here as a lifetime member. My journey for financial freedom will be here sooner rather than later with the help of the PB. Don’t be afraid to try something new. PB has your back!",
        "timestamp": "2022-06-08 13:14:33",
        "total_reactions": 27
    },
    {
        "username": "MANIMAL",
        "content": "What a GREAT EXPERIENCE!!!!!!!!  I have been a member of PB now for nearly 2 years and just became a LIFETIME MEMBER due to the overwhelming satisfaction I have gained by not only the knowledge that PB has provided me with, but also the community of everyday people just trying to better ourselves and create more for our lives and our families.  Learning not only how to trade but more importantly manage risk and execution fundamentals , I know that I will one day be able to quit my day job and trade full-time.  MY LIFE GOAL!",
        "timestamp": "2022-06-03 19:20:57",
        "total_reactions": 33
    },
    {
        "username": "Dora",
        "content": "I started with PBU 2 months ago. @O.G.Nikki, reached out to me when I joined the premium. It did not respond to her. I was not into the group 100%.A couple of days later I decided to respond to her. I would like to thank @O.G.Nikki, @AmmaJamma, @LT.👑\"RH Overloard\" and @MrStockLockProfits for responding to my messages and calling me giving me advice . I highly recommend this group and I am proud to be part part of the group.",
        "timestamp": "2022-05-22 05:42:16",
        "total_reactions": 63
    },
    {
        "username": "Deleted User",
        "content": "Just wanted to take a minute and thank everyone here at PBU for all their help and support. I started this stock market \"hobby\" around 3 months ago with a $50 investment that to be honest I wholeheartedly expected to lose every penny and move on. Fast forward three months and a whole bunch of awesome help, support, encouragement, and education from the guys here at PBU and I must say I have been pleasantly surprised. At the time I am writing this I have a net account value of $1931.74.  Along with that I have also withdrawn exactly $1000 and put back into my checking account. So in total with a lot of help and guidance I turned $50 into just shy of $4000!!!   The first two weeks I tried doing it on my own but quickly realized there was much more to the stock market than throwing a dart at a list and hoping the stock goes up lol. I decided to join the team here and have no problem saying for the first month I blindly followed the alerts with no real understanding of why we were buying the stock or how they were getting the targets. I just bought every alert and was just happy to be making money. The real beauty of PBU is that this is NOT what they really want!! They go out of their way to make the education and resources available so we can not only follow their plays, but also understand why, to make informed decisions, and with time begin being comfortable making personal plays and purchases with all the needed information, confidence, and the knowledge that if we get in trouble they are there to help. And yes I have been on the wrong end of a red trade more than once, but the offers for one on one help and support and sometimes just a much needed word of encouragement are never in short supply!! Thank you all for the time, education, and encouragement. I can't wait to see what happens next!!",
        "timestamp": "2022-05-11 07:15:19",
        "total_reactions": 77
    },
    {
        "username": "LazRazr",
        "content": "What’s up! Just sharing my experience - this has been the best group that I’ve joined. Initially I was very skeptical but the results that I’ve gotten in the past week following the alerts were amazing. Even when I lost on certain plays, everyone was extremely nice and even offered to help me understand the trades better, this clearly shows that they are willing to go above and beyond to help the members. Definitely life changing if you religiously follow their rules and play within your means.",
        "timestamp": "2022-05-06 15:44:28",
        "total_reactions": 37
    },
    {
        "username": "Big 🆀🆄🅴🅽🅲🅷™",
        "content": "**SO IMPRESSIVE!!!**@scalpin42",
        "timestamp": "2022-04-25 20:31:52",
        "total_reactions": 30
    },
    {
        "username": "Scalpin",
        "content": "Here goes nothing. I started with PB in spring of 2021 I believe. Initially I had very low expectations as most groups I have followed before being to trade their calls had a terrible win %. Within a couple months I saw what these shotcallers were putting out and started to take some of their calls. But I was barely making gains selling to soon holding to long. So I dug in and decided I wanted to really learn why and what to looks for. After lots of ups and down I'm not only taking calls from them but also able to make my own picks. I owe PB everything not just for the calls and wins but the knowledge of making me a better trading, the answering questions and explaining the answer if i dont understand.I started taking my trading very serious the week of easter and can't wait to continue to grow and make money with y'all. BY FAR BEST TRADING COMMUNITY EVER",
        "timestamp": "2022-04-21 16:53:27",
        "total_reactions": 26
    },
    {
        "username": "Shaun",
        "content": "Hi Everyone.  I wanted to take a moment to describe my experience with being a Pennybois Member for over a year.  First and foremost the shotcallers, mentors, admins, and members genuinely care about your success.  In addition to the helpful alerts, they invest in YOU by making the PBU available to premium members. If traditional cirriculum is not your thing, there are a lot of hosted livestream events to discuss various topics about the market, trading and all things related .  The knowledge and experience that you will gain by being a member is priceless.  Pennybois does not try to fit you into a one size fits all strategy, but encourage you to conduct your own due diligence and stick to your plan to keep your hard earned money.  This group is very honest and is not one of them fly by night, pump and dump operations.    Be open to learn, build a plan, stick to that plan and #makesomebread!",
        "timestamp": "2022-04-20 22:35:56",
        "total_reactions": 19
    },
    {
        "username": "BRon_B",
        "content": "I am fortunate to have found the Pennybois crew, I found this group on FB July 2020 and have been following since, right as COVID was starting to simmer. I cannot tell you how much of a great/positive distraction this group was from all the news happening in the world. Its therapeutic lol. PB was and still is a great release from the issues of this world, from the creative names to the personalities behind those names, but most of all for the real down to earth people they really are. Learning is just part of the benefit of this group, the support, the outlets, the comedy that this great group of guys and gals do is amazing. And the knowledge and education base is still growing. I couldn’t be happier plus I get to set up my family for future financial success. If you are still searching for a group, a family, a place to break away during stressful economic and social times, this is the PLACE, where you can Live, Love, and Learn, THIS IS THE PLACE!",
        "timestamp": "2022-04-16 17:36:09",
        "total_reactions": 23
    },
    {
        "username": "SpaceTraveler",
        "content": "Bear with me, I  am not a good writer since English is my 2nd language.  I started with PB back in July 2020.  It's been a great ride so far.    I work 12-13 hours a day, so I was casually trading.  I listened to a few live sessions from John (tagman) and started compounding gains like he encouraged, even 1-2%  capital.  Everyone here is encouraging and helpful, especially @taylor_ish and @jacale.  I really appreciate the Pennyboiz family here.  Thanks everyone",
        "timestamp": "2022-04-07 03:08:15",
        "total_reactions": 61
    },
    {
        "username": "Roz the Gargoyle",
        "content": "Today I had a 1 on 1 with <@!703789442787311686>. All I can say about her is WOW! I’ve been here for 6-8 months now (I forget when I signed up) and today was the most educational day I’ve had here. As someone who works nights that start at 7pm and end anywhere between 3am and 7am it’s tough to daytrade outside of Mondays and Tuesdays. When LT was brought on in January I was intrigued by what she had to say/teach about spreads. For someone with not only limited time but also funds they are a great way to play options while not having to hawk every play and also minimize my risk.\n\nAfter today’s 1 on 1 I understand spreads and the greeks SO much better than I did yesterday. I told her earlier I feel like I need 10 more 1 on 1’s but that’s because she has so much knowledge that I could pick her brain for hours. Her style of teaching is awesome too! We would discuss a part of a spread play and a few minutes later she would ask me a question to confirm I understood what we had just went over. It really helped build a foundation for me and also built my confidence up which I needed. I can’t wait to put today’s information in to practice. This definitely won’t be my last 1 on 1 with her!! If you want a better understanding of spreads or really anything at all I would 1000% recommend LT for a 1 on 1! Thank you again LT!!",
        "timestamp": "2022-04-06 21:50:19",
        "total_reactions": 39
    },
    {
        "username": "jtm86.",
        "content": "I started here very close to the beginning in March ‘20, a new trader right as the market was crapping out bc of Covid. I knew nothing but “buy low, sell high” the education here is immeasurably helpful, it truly made all the difference for me. We’ve evolved together, myself and PB. It’s now 2 years later, PB is better than ever and I’m finding my grove trading more and more all the time. Learning charts, even minimally, helps a ton and we teach that here. I’ll be here for the long haul and hope to help other new traders like myself 2 years ago to be profitable and more importantly LEARN what they’re doing not just monkey see monkey do. The community here is outstanding and I’m proud to be a part of it 🤘🏼",
        "timestamp": "2022-04-04 17:24:06",
        "total_reactions": 25
    },
    {
        "username": "Redgulf3",
        "content": "What else can I say other than PB truly has changed my life. I got very lucky when I first started trading, and then VERY unlucky, and lost almost everything. I nearly gave up trading when I came across this group. I joined and immediately felt like this was the place for me. There are hundreds of different groups that you can subscribe to and get alerts. Some of them work, most don't. But this is the first group I have ever been in that actually spent the time to teach me *how* to trade. I have been here for a year and a half now, and this group has changed **everything** for me. With the profits here I was able to make a sizeable down payment on my home, and now my mortgage, motorcycle, and truck are all paid **only** with the profits here. \n\nWhile I am still a very new trader, I now have the confidence to make my own trades, not just taking the alerts. On days that I don't trade, I STILL come to this group because I generally love just chatting with people. This place feels like home.",
        "timestamp": "2022-03-31 23:23:19",
        "total_reactions": 60
    },
    {
        "username": "joejoe",
        "content": "I dicovered Pennybois in early 2020 and was initially skeptical of the advertised win rates. I quickly found the claims to be valid for great trade calls as well as a very welcoming community to participate in. I had a few big winners early on and got overconfident in my own skills, which led to poor decisions and the market reclaiming most of my early gains. Once I completed PBU and committed to the \"buy in slowly\" strategy coupled with some paytience, things turned around and my equity trading became profitable again. I decided to explore options and found a whole new learning curve to overcome. The shot callers are incredible not only in their calls, but also in their willingness to guide folks along and answer questions.  I recently scheduled a session with <@!703789442787311686>  to learn more about options spreads. <@!703789442787311686>  is a patient and effective teacher and I was able to put what I learned to use immediately. I enjoy options although I still struggle a bit with emotional trading and not letting the winners run more, but I'm getting there. The entire Pennybois experience has been awesome from day one. It's great to be in a community where everyone is eager to support and encourage each other regardless of account size or experience level. I'm amazed at how much I've benefited from all the resources available in PB and can't imagine not being part of this community as long as I'm actively trading.",
        "timestamp": "2022-03-31 01:00:10",
        "total_reactions": 75
    },
    {
        "username": "PookiesRevenge",
        "content": "BamBam! This is incredible, I'm so happy to read that and I'm glad you're here! That's amazing 🤩",
        "timestamp": "2022-03-29 08:14:09",
        "total_reactions": 6
    },
    {
        "username": "AltarnateMediaMaggid",
        "content": "I started with PB in 2020 within a few weeks of trading on robinhood. Everyone was very welcoming and happy to help in anyway possible. I was in the first PBU class, I learned a lot. I had read books watched hours of youtube videos on trading and its different types. \nI got to have conversations with the leadership and the shot callers who gave me realistic advice and encouragement. I remember being told that it is normal for the learning curve to take a year or two. I was playing with small money, only being able to deposit small amounts. So I did what was taught. I made a trading plan, payed close attention to the alerts did exactly as instructed. \nAfter a while, continuing to study and be very careful with my plays. I took an initial few hundred dollars to close to 20k. Then I did the one thing that will be pushed on you from day one. DO NOT PLAY ON EMOTION. I started to panic and refused to take a loss until it was a big mistake instead of a small one. I got spooked and tunnel vision to the point that I lost it all. I restarted with $75, contributing a $50 here $75 there and ended up putting in about $300 total and stopped depositing. \n\nSo I went back to the basics, recreated my trading plan, go back over the class material and notes. but the biggest thing I did was I stopped being so rigid with the calls and the % to gain or lose. Instead tried to understand what it was that the shot callers were seeing that I wasnt. With that, I started looking at their patters, not just the stock patters. Once I got an idea of what they were doing is when I went back to studying the charts.\nAll this while still enjoying the comradery, energy, and good vibes. Everyone has been great and now over the last 2 months everything has started to just click. I am now from 6 weeks ago having $500 to to almost 11k. As long as I dont freak out and stick to my plans and keep my emotions under control I will be great!\nAll this to say that PB is amazing in every way and worth every $",
        "timestamp": "2022-03-29 00:32:30",
        "total_reactions": 40
    },
    {
        "username": "Milky Chansey",
        "content": "I joined PB at the end of 2020 because I wanted to learn how to take control over my investments. I’d been throwing money at stocks people recommended on Facebook. Oh god what a mistake! Don’t do that lol. Anyway, PBU is amazing for learning the fundamentals and emotions of stock trading, and the shot callers bring tons of experience and tidbits of knowledge on a daily basis. I have ADHD I’ve learned to cope with as well as some ASD so I don’t learn like everyone else. I’ve made mistakes along the way as I tried to make my own plays or stayed in them too long. But every mistake taught me to stick with my plan and remember what PB taught me about emotions, and taking profits. The most important things I’ve learned is TAKE YOUR PROFITS and don’t look back. Only 3% gains per week will make you rich. SET YOUR STOP LOSS and move on if it’s triggered. NO EMOTIONS. Don’t become attached to a stock because you think it’s going to go up more. DON’T GO BIG while you are learning. I’m down quite a bit since I started learning. But everything is finally coming together. I’m up 37% over three months, and 80% over the past month. I’m not focusing on getting my past year in the green, I’m focusing on gains one day at a time. Thank you Pennybois for turning me into a stock trader!",
        "timestamp": "2022-03-21 18:20:38",
        "total_reactions": 44
    },
    {
        "username": "TheDocta",
        "content": "I originally started with Pennybois in May 2020 after losing a bunch trading on my own due to extreme ignorance. After joining, I quickly began to realize that it wasn’t the alerts that mattered the most, it was the lessons they teach both inside and outside of pennyboi university, the community support, and the mindset they preach every day that makes the biggest difference. I would love to say I quickly regained thousands of dollars afterwards but unfortunately I’m a slow learner and stubborn to a fault. Balancing grad school and learning to trade, some days are better than others, but this community has ALWAYS been there for me and anyone else who ever needs the help. I now find it difficult to ever imagine not having this family within reach and I plan to be here for life. My goal since joining is to trade well enough to pay off my wife and my student loan debt. I have no doubt it’s achievable, and it will happen, it’s just a matter of when.\n\nNot enough amazing things can be said about the staff and the effort they put in. The play calls are amazing on the daily basis but more importantly the lessons to trade on your own with chart readings and risk management sets everyone up with the tools to build a successful trading future. Through lots of failures, I have personally learned what works for my own mentality and trading style vs someone else. Anytime I go against my personal principles, they bite me in the butt but they are used as a learning tool to get back on track. My biggest lessons from this community: The percentages matter, not the dollar amounts! Small incremental gains and compounding interest beat a rare 1000% runner any day. This community is here to help people build their future and I absolutely love it. They truly care about helping everyone succeed. Stay humble and always ask questions. If something isn’t working, ask why. How can they be better next time? Take notes. Stick to the plan. Learn from mistakes. Don’t be greedy, and be Pay-tient.",
        "timestamp": "2022-03-19 16:37:34",
        "total_reactions": 34
    },
    {
        "username": "Snowflake(4P's)",
        "content": "Started thinking about what to write in this testimonial and had no direction. So I decided to use google photos because I screenshot EVERY thing. Go back exactly 1year and my little 150ish account is on a steady downard descent. I was trading dogecoin on my robinhood along with anything I had seen literally anyone mention online. Hmmm 5 people said this is going to 🚀🚀🚀 and its been red for 3 days NO DOUBT its about to shoot up. I bought Roblox from IPO because robinhood offered it and my research showed that my daughters LOVED Roblox. Actually bought in at 75 and its about 49 now. That account 1 year ago was STRESSING me out so bad. Money was tight so I'd add $10 or $15 from my check every friday so I could immediately buy a share or 1/16th of a share and get the relief of being -34% instead -35%. Fast forward to today. Working 70hrs a week currently and ( I really want to emphasize this) STRESS FREE trading 3 accounts totalling around 4k that are currently hitting 5 to 10% weekly on weeks I'm actively trading,  because I also learned I don't need to buy or sell daily or weekly to be successful. No yolo's, no hope and praying,  no angrily adding money to try and buy my way out of red. Just patiently, slowly and with a thoughtful purpose building a position OR jumping in on a quick momentum play. This group HAS and continues to change my life daily. I have zero doubt I can eventually become a full time trader. Thanks for coming to my ted talk and I hope I can offer you some type of help in here one day",
        "timestamp": "2022-03-19 00:25:58",
        "total_reactions": 35
    },
    {
        "username": "DizzyDenee’",
        "content": "Pennybois is the place to be!!! I cannot say enough good things about this community! EVERYONE in this group is about helping others in a fun, positive, educational, and nontoxic community. Pennybois has become my family. Today I want to share my personal experience with the newest addition to the family <@!703789442787311686># L.T’s speciality is spreads. I recently scheduled a 1:1 with L.T. I knew absolutely nothing about spreads and had told her I would need spreads for dummies. 🤣  L.T. is an excellent teacher. She took her time and made sure I understood the basics of spreads, always stopping to confirm I got it. One of the best things is when I didn’t get it, she broke it down differently, until I had the ‘ahhaaaaa moment’ 🤣 and it finally clicked. She is very knowledgeable and it was a joy and privilege to get some 1:1 time with her and to learn from her! She later helped to walk me through my first Put Credit Spread and again answered all my questions throughout the trade. I work ALOT and while I am able to focus on some day trades I wanted to be able to do other things to help grow my account that wouldn’t require my constant attention throughout the day! Thank you <@!703789442787311686># for your time, patience 😄and genuine interest in making sure I understood spreads. The basics anyway, we’re taking it slow! 🤣🤣🤣",
        "timestamp": "2022-03-18 22:43:45",
        "total_reactions": 55
    },
    {
        "username": "George4Man32",
        "content": "Thank you for allowing me to share a piece of myself with a largely publicized group of people. I want to take this moment to say that I've been trading for 3 years now. Last year was the first year I gave PennyBois a shot after seeing them on Facebook. Last year was also the first year of my trading career that I profited money. (14.1k)  I work full time and sometimes 2 jobs so I don't get to invest my time into this as much as id like to. This group helped me learn mainly to STOP BEING GREEDY! Those 5-10% gains add up, I PROMISE. Stop looking at the dollar amount and look at the percentages gained. As many of you in here and myself, we know money is hard to come by. But if we grind like we deserve to be the \"One-percenters\" we will become one of them. With this group as a tool and a welcoming family it can be done. Thank you PennyBois for my first year last year profiting LARGELY and I look forward to paying taxes in 2023 because of you all. And thank you all for being such a welcoming community. \n#ItsNotIfItsWhen 🔥🔥🔥",
        "timestamp": "2022-03-18 21:51:06",
        "total_reactions": 31
    },
    {
        "username": "ruuhrow",
        "content": "Took a 1 on 1 with <@!703789442787311686>  this past weekend. Was absolutely amazing. Learned so much more on spreads than I could of imagined. I trade while at my job, and these spreads are nice since they don’t require much babysitting. She was very helpful, giving examples, and asked me answers to the examples, which is one of the best ways I learn. Was defiantly worth it! Thanks again !",
        "timestamp": "2022-03-17 20:37:13",
        "total_reactions": 19
    },
    {
        "username": "Big 🆀🆄🅴🅽🅲🅷™",
        "content": "OH \n\nMY \n\nGOD \n🔥📈💙",
        "timestamp": "2022-03-16 03:34:33",
        "total_reactions": 11
    },
    {
        "username": "PookiesRevenge",
        "content": "Holy!! That's amazing!!!",
        "timestamp": "2022-03-15 22:30:00",
        "total_reactions": 1
    },
    {
        "username": "Deleted User",
        "content": "I have been member since 2020 November at a time I was pregnant didn't have any knowledge about trading. First I started learning about trading through PBU and later I also took Advanced classes with <@!132142524771860480>. Now I developed my own trading plan that really works for me. Since joined Pennybios my account is up 1.8M and I only started with $2000. As a busy MOM didn't get a  chance to really say how THANKFULL I am for helping me to achieve financial freedom. THANK YOU Pennybios Team. 🙏🏼 😊",
        "timestamp": "2022-03-15 21:46:29",
        "total_reactions": 174
    },
    {
        "username": "odof654",
        "content": "Pennybois is actuly an unreal community where people can talk to seasoned trading veterans and learn important trading tools from the pros and having a direct line of communication with them means you have support through every part of the adventure! the trading psychology units in PBU are more valuble then you know. for example I got shook out on X. a few days ago and sold for a loss, if I started a smaller position I would of been in a better mindset and in a better position to average down, I took lessons from this and applied it to SPY when it went south. Although I did end up averaging more then I should of I’m happy that I was able to move forward and handle this situation much better and made 25% gain. What I’ve learned from PBU has been an invaluable tool moving forward and thanks for all you guys do!!",
        "timestamp": "2022-03-11 20:19:23",
        "total_reactions": 20
    },
    {
        "username": "subtle69",
        "content": "Pennybois has become a family to me since day 1 of joining. I've been a member now since the beginning of November 2021, and have made the decision to be a member for life. Before finding Pennybois, I had a whole list of randoms that I followed on TikTok, YouTube, and different Reddit/Wallstreet* type of websites for meme stocks. All of the hype from $GME, DOGE, and $AMC had me biting at the bit to get into stock trading. Hearing about all of the people turning $1000 into $100,000 or more, who wouldn't right?! So I jumped into SHIB coin and made a decent profit. I got lucky on that one. Through all of the influencers on TikTok, my impression was that <@!569789305719881730> was the most sincere and real. I decided to join as a free member. I went through the free PBU courses, and within that same day I signed up for a 3 month subscription. It wasn't even a month into that I decided to go a full year. I realized the value that PB had to offer, not only for the education that you get in the PBU/PBA, but also the benefit of being surrounded by like minded individuals and experienced traders. There is ALWAYS someone there to lend a helping hand, or even just to talk to. I have a lifetime membership to another group that shall remain nameless, but it is NOTHING compared to here. Lesson learned, and I'll take that financial loss for the clarity that lesson provided me with. I have nothing but love for this place!\n\nLet me be blunt. I have lost money since I have joined PB. The losses are on me for not heeding the learning that was being provided to me, and really just keeping that mindset of pride over humility. We are taught how to trade with minimal losses, and there is even a way to practice with no loss at all! Since I have let go of my ego and started paying attention to those with more experience than myself, I have gone from -40% on my account to +13.82% and counting. The sky is the limit, (meme stocks optional). Come join us and see what the hype is all about!",
        "timestamp": "2022-03-11 20:02:11",
        "total_reactions": 15
    },
    {
        "username": "Rocket",
        "content": "I've been a part of the Pennybois family for about a year already, and it is worth joining. If you dedicate yourself to learning then this community can really help you turn your losses into gains. You just have to follow your plan and take it slow. If you every need help then you can get plenty of help over here. I blew up my account and have about 20k in losses, but after being here, I am slowly gaining it back. In a bull market it is easy for anyone to make money, but it is in rough times like these that you really need help navigating the market. So many other groups out there claim to help you out but they don't want to hold your hand, over here everyone will literally hold your hang every step of the way so you can learn to succeed. Of course right now it is one of the hardest periods to trade in but that is why we have so many shotcallers that can help you. Just try it out for a few months, and you might just like it so much that you decide to stay. The prices are so reasonable and they actually give you all the tools you need to succeed. Even if you you are busy, it is easy to make a profit over here. We have so many instances where shotcallers will actually give you a free one on one session from the goodness of their hearts just to help you succeed. This community is all about helping each other out, come try it and you will see what Pennybois is all about.",
        "timestamp": "2022-03-10 17:44:23",
        "total_reactions": 20
    },
    {
        "username": "krissyjana",
        "content": "Pennibois University is a core three month deep dive into trading and creating your own charts. Combined with other courses such as Pennibois Advanced coursework; diving past the fundamentals, there is aces to lessons via video, live conversations and live trading using the concepts taught. We can do real-time trades alongside the amazing staff. When you are trading real money, having the support of tens of other learners available real time is invaluable. Weather you are a new trader or have advanced experience, I am confident that EVERY LEVEL of trader will find value in these courses. Being a teacher and mom. I was able to complete the learning on my own flexible schedule through the week. I am able to trade with confidence. When I’m just having a bad day, I can lean on the shot callers, staff, and my friends. New  people with random names who have become by partners in all of the ups and downs. I could go on and on, I can explain all the ups and downs. \nMy own, honest to God experience as a member of Pennibois, is far beyond what I had expected. I have hope for my future. I believe that there are opportunities far beyond where I sit right now. My career has a limited salary. I have planned every aspect of my life around the same salary schedule. I knew ONLY boundaries when focusing on what I would be able to do with my set income. I now have a new sense of vision and it’s allowed me to seek higher rewards and to change my negative mindset.  I have a trading plan, a budget and goals including my first goal: walking into the San Francisco Tesla Dealership as a buyer. \n💗",
        "timestamp": "2022-03-10 00:56:07",
        "total_reactions": 30
    },
    {
        "username": "krissyjana",
        "content": "Having teens at home, Discord left a bad taste in my mouth. I had no idea how it worked. I know this is a major point of contention and confusion, but I URGE you to not give up. Discord is simply a platform that the company has used as they’ve grown at such a fast rate. If you want to join PB for alerts only, you will have the opportunity to profit  with in house shot callers giving targets and stop limits. These are analysts that range from 80-90% profits monthly. \nI suspect that you will want more as you see profit potential rise above the “safe” targets. Soon you will notice the opportunity for more profit and begin to watch your chart along with the shot callers and other members who work in real time along with each one of us. The conversation, knowledge and understanding begins to bloom via conversational voice channels, private messaging, or simply by asking a question in the general chat (think FB feed but all about everyone’s trading life). Should you be motivated to improve your profits, you won’t have to simply follow along and catch on.\n👇",
        "timestamp": "2022-03-10 00:55:49",
        "total_reactions": 0
    },
    {
        "username": "krissyjana",
        "content": "<@!569789305719881730>   (aka Austin) was doing a live stream video about his experience trading Doge on YouTube preaching a message I needed to hear: Why do you hate your money?\nI joined Pennibois one month and a discount code later. \nBefore I tell you the true value of Pennibois, I must address a distraction to many of us Gen Z and older: Discord. \n👇",
        "timestamp": "2022-03-10 00:54:43",
        "total_reactions": 0
    },
    {
        "username": "krissyjana",
        "content": "I found Pennibois after the meme stock craze. There was still some stale optimism. “Is Doge gonna ever get back to .70?” “When will AMC ever squeeze?” and my favorite, “I’m sticking it to the man 🚀🚀🚀.” \nBy this time I had held up over 6k of GME profit via help from the internet. Six thousand dollars sitting there; day after day as I began realizing my stocks were going up and down over and over, and I was not catching that profit. Fearful that I didn’t have an exit plan. I watched my portfolio battling the question, “What if it moons while I am out of the play?”\nThe truth is that I never had the time or bandwidth to take advantage of this money. It was 2021 and I was now teaching another year of 4th graders from my kitchen table , and life seemed upside down until life flipped back up again as I took a new path in the right direction. \n👇",
        "timestamp": "2022-03-10 00:51:42",
        "total_reactions": 1
    },
    {
        "username": "dra4896",
        "content": "Where do I even start!… Pennybois is the place to be, whether you need 5 star play callers, education or just a freaking awesome community of people just like you! I found Pennybois in august 2020. After taking some free alerts I felt like I could make millions so I paid for a month and lost everything I had made plus some. Got depressed and started second guessing if I could do this. I’m to hard headed to just give up though. If I want something I’m gonna get it, even if it’s takes me forever. It was shortly after that I realized Pennybois had PBU! PBU and the education alone are worth every penny spent here! I spent early 2021 in PBU graduating in April 2021. I have continued to use PBU videos to learn and refresh. When I started PBU I knew nothing about charts or trading other than how to buy and sell. If you are looking to learn I highly encourage you to take PBU. Now it is like anything else, you get out what you put in. If you aren’t willing to dig in then you probably won’t learn much.  I work a normal 7:30-5:30 job and trade from my phone. So if I can do it without being able to dedicate all my time to it then so can you! You have to listen and follow though. Trade like they teach you. Read charts like they teach you. Buy slow like they teach you. Follow a plan! Even if you have to change that plan to make money. Finally I want to say this community has helped me in countless ways including dealing with DEPRESSION. The people here are real and care about you! I am here for the community as much as anything now. I LOVE PENNYBOIS. THIS PLACE IS FAMILY! ❤️💚💙 THE STAFF IS SO SUPPORTIVE AND WILL LISTEN TO WHAT YOU HAVE TO SAY. I’ve been in other discords as well and none of them get close to PENNYBOIS",
        "timestamp": "2022-02-24 19:10:36",
        "total_reactions": 51
    },
    {
        "username": "ruuhrow",
        "content": "So I joined pb last year when dogecoin got popular lol. I started taking alerts within the first few days of joining not knowing what I was doing, even after reading to just watch and get a feel for it. I did terrible because I was just taking alerts without knowing why. I gave up after a month. I came back this year in January. This time I applied what they reach out in pbu, took the time to figure out what my trading style is, which took me a while because I work 730-4 and had to find a way to be able to take alerts while at work. After finding out options is what works best for me I started taking alerts while I would be on my breaks or lunch. And it’s been amazing. The community is great. In the beginning I was struggling a little. With out even asking for help my self <@!738951697648320624>  asked how everything was going. I vented to her a little bit and she gave me a bunch of resources. And that gave me hope to not give up like the first time. I’m up 25% on my small account just this week. You guys are amazing. They cater to all types of trading styles. So if you’re trying to get into it and are new they do small account alerts as well which has been tremendously helpful for me. Thanks PB you guys are fire!!!!",
        "timestamp": "2022-02-24 15:58:32",
        "total_reactions": 26
    },
    {
        "username": "GoofyGuberz",
        "content": "I started back in the DOGE days of winter 21'. A friend had me mindlessly put money in and I made $400 by the time I got home from work. I was hooked. I then followed YouTubers call outs....terrible idea. It would literally pump and after you got in dump. I knew there had to be a better way. One night mindlessly scrolling TikTok I found BigQuench and realized you know what he's right. I'm too sexy to be losing money. I started here in Feb 21' and broke alot of rules. I went through PBU and still struggled. It ended up with a 1 on 1 with Pookies to get this train back on track. I watched every Livestream I possibly could for about 7 months. I proceeded to dig myself out of the hole I had and finished the year green. If you take this seriously and follow the rules you will prevail. Experience takes time, preserve your capital while you learn. The people here care , often times here 16 hours a day or more. Where else do you find that from people who actually help? One trade paid for a year here so IM NOT LEAVING!",
        "timestamp": "2022-02-23 21:59:01",
        "total_reactions": 18
    },
    {
        "username": "Chena",
        "content": "Where do I start?  I started this journey in Oct of 2020.  I stumbled across PB discord through Facebook....I did not even know what a discord was.  So I thought well I will give it a month and we will see what happens.  Well here I am a year and 4 months later and I just had my best day out of my best month ever.  $4270.80$  in ONE day!  This family has changed my life and if you put the work in and take the classes and self analyze to find out your best trading strategy I can't see how you could fail here.  If you get stuck, there is ALWAYS someone to help you, whether it be a member or one of the FABULOUS staff at PB.    I can't recommend PB enough.  I have ventured a little and tried other discords just to see....since this was the first one I came across..I had nothing to compare and let me tell you, there is NO comparison!!! If you want to change your life and you are willing to put in the work and ask questions and be honest with yourself then sign up and if you are already signed up extend your membership to yearly!  I could go on and on and on...but I think you get the drift.  I will be here as long as Pennybois are here...I hope to grow old with my new family!  Cheers!",
        "timestamp": "2022-02-23 19:01:08",
        "total_reactions": 34
    },
    {
        "username": "Last_Tangent",
        "content": "I had a great 1-1 with <@!703789442787311686> yesterday.  I have a larger portfolio and it's not practical or probably responsible to grow it substantially simply by day trading options.  Plus I don't want to be tied to my computer every single day.  L.T. has a different style than the other option callers and I feel her style will be a great additional to my trades, allowing me to make money even when I don't want to take the time to actively trade every day.  Scheduling a 1-1 with her allowed us to discuss trades and suggestions specific to my preferences and holdings.  She's a great asset to PB and to the Options team.",
        "timestamp": "2022-02-22 23:25:05",
        "total_reactions": 45
    },
    {
        "username": "PookiesRevenge",
        "content": "That's amazing dude, congrats! You NEVER annoyed us, we get pumped up when our members ask questions because it shows us they want to learn and be better. I'm glad you're here, man. Scouts out! ❤️",
        "timestamp": "2022-02-12 00:41:11",
        "total_reactions": 7
    },
    {
        "username": "Trader Formerly known as Scott",
        "content": "I have only been trading for about two years now. Just like thousands of other new traders I got hooked on the news about GME, AMC and the other meme stocks and dove in. I started with $1K  and after a couple of months I turned it into $5K off of GME. Had several lucky runs (who didnt after Covid) and soon had over $10K in my portfolio after starting with just $1K. I thought I was a genius and had figured the market out.  Two months later and SEVERAL terrible trades later I had nearly last all of it. I had ZERO plan, was fully trading on emotion and found myself making riskier and riskier moves to try to get my money back. I nearly gave up when a friend showed me <@!569789305719881730>  Tik Tock, which led me here. \n\nIve been in a couple of groups so figured PB was just another pump and dump group or a bunch of seasoned traders making fun of us new guys. Thankfully I could not have been more wrong.\n\nRight off the bat I was in <@!699363153842143327>  many live streams (which I still join from time to time) and figured out how to set a plan and stick to it. I stopped chasing 100% runners and learned to let go of losers before they killed my portfolio. I spent countless hours talking to <@!663437684596801547>  <@!132142524771860480>  <@!596501292445204490>   <@!417715155183599616>  and tons of other shot callers developing ideas and figuring out my move. I am sure I annoyed them constantly, but they never showed anything but patience and understanding. \n\nWhats even better than the shot callers is the community as a whole. Anyone who spends 5 min online will tell you must communities are toxic and full of trolls. The group at Penny Boys are the furthest thing away. Everyone helps eachother, and after trading we all stick around just to chat and have a good time. \n\nAfter nearly a year of rebuilding from $1K up I am now just shy of $30K! I almost gave up before PB, and now I am able to pay my mortgage just off trades. Cant thank you guys enough!",
        "timestamp": "2022-02-11 23:15:22",
        "total_reactions": 42
    },
    {
        "username": "Verticle",
        "content": "Pennybois has been great for me, I have traded alot more since I started with them, and they are always on top of the game for sure. I also have brought in some friends through my journey in this discord, they have all been deeply involved with pennybois, as well as learning ourselves through what we ahve seen with pennybois. I would suggest this to anyone who is learning and starting out, and even for veteran traders that dont have time to look at the market, these guys are literally doing the work for you and its great, so from myself and the people ive brought along we wanted to say thanks to Pennybois for sure!",
        "timestamp": "2022-02-09 21:10:55",
        "total_reactions": 10
    },
    {
        "username": "JtheSPYkilla",
        "content": "I traded on my own for the past year. I had a couple of big wins that were luck more than anything. I got overconfident and ended up losing over 50K. I was about to give up trading all together, but then I discovered pennybois. While I am still new here, I have already learned a lot while also realizing how much I still need to learn. I am up about 30% overall from the day I joined PB. I still have a ways to go to recoup all I lost doing things my way, but I’m confident that by following things I’ve learned here and continuing to get better and limit mistakes, I can reach my goals. The shot callers are also awesome and very transparent. They show you the plays they lost on not just the wins. And they are very good at what they do.",
        "timestamp": "2022-02-04 23:17:43",
        "total_reactions": 15
    },
    {
        "username": "$$BIG MIKE$$",
        "content": "Hello, i started to trade in the beginning of 2019 i started with 1,000$ within 2 weeks of trading on my own that 1000$ turned into 150$ then 75 then eventually i had nothing. I am not rich by no means so 1000$ was quite a bit of money to me.  after losing it i kinda lost hope for my trading career so i stopped trading. About 2 months went by,then while i was scrolling through facebook one day i seen a post from Austin. we all know him as(Big Quench) but is was a post stating(a total of 15 100% runners this week alone) then i seen the pennybois discord link so i clicked it and joined. At first i was very sceptical about spending any more money on the stock market after my first failure. I watched the free alerts channel like a hawk for the next 2 weeks. To my surprise the plays they were calling were almost all working out for profit. So i said screw it and put another 500 into my account. Probably the best thing i ever did for my trading career, in a matter of weeks pennybois had turned that 500 into 1250$ on free alerts alone so i decided to look into premium for stocks and options. My first thought was man this seems kind of expensive at 260 for 3 months .TRUST ME IT WILL BE THE BEST MONEY YOU EVER SPEND. Fast forward 2 years later i have gained so much knowledge from the  admins and shotcallers they are always so helpful and encouraging. When you are down they all seen to make it there goal to lift you back up. which in my book is the definition of FAMILY. In conclusion i would like to say, THANK YOU to all the members of the pennybois team you help so many people. I would recommend anyone who is down on they luck in the market join here it will be one of the best decisions you have ever made..Keep up the great work pennybois team.\n                                 Sincerely, BIG MIKE",
        "timestamp": "2022-02-04 16:07:16",
        "total_reactions": 19
    },
    {
        "username": "Bebnet23",
        "content": "Ever since I was in my teens, I'm currently 27, I always wanted to trade stocks. Not necessarily as a money maker, but I'll take money lol,  but because it is more of a hobby that I would really enjoy. I finally took the dive for stock trading the first of the year in 2021. I didn't know where to start or what to do. So as any new and inexperienced trader I would watch YouTube videos to find those golden indicators where you couldn't lose and all those social media groups that say buy this stock it's gonna moon! So I learned the hard way and lost 60% of my account. Ouch! So one day I came across Pennybois. Definitely had my guards up because I didn't wanna fall hard on my face again like I have been so I just kept watching their posts. They started to seem pretty legit so I joined their discord and started taking their free alerts and man was that an eye opener.  I couldn't believe the nice and easy to follow alerts and the PBU they kept talking about really intrigued me. So still a bag holder I joined premium in February of 2021. The amount of knowledge, family setting, and helpfulness blew me away. I couldn't believe the people that would help you left and right and to lead you in the right direction. After completing PBU I really felt for the first time I was on track to start chasing my dream. I wanna be a full time stock trader as I'd be doing what I love for a living. I currently work 50 hours a week and I can still trade in my spare time. I owe all of my success to Pennybois for leading me in the right direction. And with a 80% win rate from the shot callers how can you not! Not only have they taught me everything I know, but this is a family.  A family that has your back and catches you when you fall and gets you back on your feet. I'm proud to have joined this family and it is now apart of my life.",
        "timestamp": "2022-02-03 03:17:17",
        "total_reactions": 22
    }
]