[
    {
        "username": "jasmash111316",
        "content": "I want to begin by saying Thanks 🙏… A lil about myself…. I am 39 have 3 children and a wife for 17 years. Money is always a factor/issue or argument in my home. I came to the discord in 2020 I believe never premium. I didn’t understand anything going on here nor have any knowledge of where or how to start! So I popped in and out and did my own thing after covid I ready wanted to learn more. I watched tons of free videos and options was the first thing I fell in love with when trading. Skip ahead….I start actually attempting to make trades on the free side and play the free watchlist things weren’t terrible…. This is 2024 Thanksgiving. I saw a great deal on the premium and took the leap. Right from the start @o.g.nikki was right there guiding me though the channels and ready to (Help keyword). I have no idea if I used the quotation correctly! Any way I got a coach @btc_jay he was great. Learned a lot about equity’s and liquidity in the market. But this wasn’t what I was used to and like a lil faster pace. As I said I had been in the free live trading with @officialethanschleder and loved options. So that was that switch up coming. Nikki listened to what I was saying and pointed me right where I need to be and Ethan became the one ☝️. He has Helped me in the last few weeks more than my coworkers of over a year!!! I will probably write more but we will wrap up here.                               I will and I can, you have something I want and I will Succeed, I will take what you have without you loosing it, I will learn I will succeed!!!   Also thanks for giving it!!!! @here",
        "timestamp": "2025-02-01 17:41:34",
        "total_reactions": 248
    },
    {
        "username": "JenniG1981",
        "content": "Ethan has been my coach for about 3 months now. I have learned so much from him that I am now finding my own profitable trades. Watching him do live trading, and hearing him think through a trade out loud on top of taking his courses has been so helpful for me. I’ve learned how to spot a good trade, use rationality to make the best decision with how heavy or light to go into a trade, and how to scale out. I highly recommend getting a coach because it has helped me become a profitable independent trader. Ethan is fantastic! Thank you @officialethanschleder",
        "timestamp": "2024-11-04 21:53:19",
        "total_reactions": 125
    },
    {
        "username": "Timbz",
        "content": "Hi family, \n\nPennybois is a foundation and home for me, especially with being a brand new trader, long term investor and getting my feet wet in the market. \n\nFor a long time (since 2021) and now, a Premium member as of a month ago. In reality, I should have joined premium a LONG time ago. BUT, its never too late.\n\nAnyhow, simply put, and in short, I want to give a massive level of GRATITUDE and CREDIT to @mrslp for helping ME and our team all become better, smarter and profitable going into ANY trade. \n\n***We have all learned tons of  GOLDEN knowledge, and the knowledge is still pouring into my bucket.***\n\nWhat have I(We) learned?\n\n> *The Fundamentals.....*\n\nSet a goal based on your portfolio size. Small gains = big wins.\n\nStudy the charts. Look at the levels. resistance and support, RSI, etc.\n\nStudy the company. Are the financials good? Upcoming earnings? Is the stock oversold? Is the stock undersold? This can help guide you to the decision and approach of your trade.\n\nKnow exactly how much you're going into each trade with, how much you're risking and when you're exiting, with either profits or losses. (SET YOUR TAKE PROIT and STOP LOSS LIMITS)\n\nAim for a percentage you can make on every trade, do that once, do it again, over and over until you can be CONSISTENT and evaluate from there. Clearly your strategy is working. \n\nAll in all, once you know what to do, do those things. I just explained them all.\n\nBUT, before ANYTHING - practice your strategy with FAKE money (this is best practice in my opinion and why paper trading is a massive massive benefit and point of levrage for new traders) LOSE fake money rather than LOSING your real hard earned money. Once you see your strategy works, apply that to your trade with REAL money.\n\nand finally...... \n\nDont trade with emotion.\nDont chase a trade.\nThere are plenty of trades out there. You wont miss your flight, another one will come.",
        "timestamp": "2024-09-26 15:20:53",
        "total_reactions": 241
    },
    {
        "username": "kennypenny",
        "content": "I’ve been in Penniebois for a few years. There’s several people that really stand out, and Lee is really one of them. His patience and wisdom are above and beyond. As myself, a mediocre trader at very best, he gives me someone to look up to and to look forward to hearing over the wire every chance I get. He’s always a gentleman, he never criticizes only coaches. And I’m glad he’s here. Thank you Mr. SLP.",
        "timestamp": "2024-09-24 13:59:27",
        "total_reactions": 88
    },
    {
        "username": "TnT0619",
        "content": "I have been with Pennybois since February of 2020, and am one of the original members!  I have seen many members come and go,  and many changes within the Discord.  The one thing that has remained a constant in my trading/investing journey has been Lee.  At the beginning, I knew nothing at all about trading, but trusted Lee's alerts from the get-go.  Not only is he remarkable at what he does, but he also genuinely cares.  The addition of the coaching programs was genius-and I feel very privileged and honored to learn from someone who is so exceptional at his craft. Lee has taught me so much along the way, and has made me a more confident person.  His style of teaching is very easy to follow and has made me excited to learn as much as I can!  Unfortunately, we started saving for retirement late in life,  but thanks to him, I know that someday my husband and I will be able to retire, and that no matter what,  I can always find a way to make some bread! (sorry-had to throw that in there 😉 )  Thanks for always being a great mentor, an amazing person, and for always being there! 💜",
        "timestamp": "2024-09-24 12:26:51",
        "total_reactions": 94
    },
    {
        "username": "Faa • rooq",
        "content": "I have been here as a premium member almost since I joined in early May 2024. Lee, aka MrSLP, aka MadMaverick.... was my very first mentor.  I didn't stay with him very long as he went on a little vacation.  To be fair, I'm a very strange fellow.  I like things a certain way.  I moved mentors.  I'm on my fourth or fifth now... and I'm back in his group as well. In the past 4 plus months, I've seen a little success followed by my implosion.  I went down 4K in a heartbeat.  Even though he was not my mentor at the time, he was the ONLY coaching mentor who checked in on me.  He was the lone voice when I was riding high, and advised me to take it easy. Apart from his great knowledge of the market, he is a great person.  I have the highest respect of a person of his calibre.  I, personally, didn't learn anything from him because I wasn't looking for what he was doing.  That's just me.  Other coaches did show me avenues that excited me.  Lee is instrumental in my life as a trader because he checks in on a trader... to see if they are OK.  Do they need a hug or a scolding.  I needed that.  I received it from him.  If you want to succeed, he's just one rung of a circle of coaches here that will get you to YOUR next level.  I can't recommend him enough.  So you might ask, if I'm not learning anything from him... why am I in his group? Well, i love to swing trade.  He's a master.  I check up on many things he posts as possible stocks to get into.  That's why I'm with Lee. I wouldn't be here today without him.  Thank you Lee for being there.",
        "timestamp": "2024-09-24 01:36:39",
        "total_reactions": 83
    },
    {
        "username": "thΞChag",
        "content": "Ethan knows his way around the market, especially the main big tech stocks. \nEthan has been able to teach me patience, to wait for my trade, planned ahead, and execute it like a surgeon.\nI still have a lot to learn, but in terms of option day trading, I owe him a great deal of gratitude for all he have shared with us so far.\nThis young men  is not only able to teach and execute trading strategies, he's able to share experience and wisdom with great psychology nuggets.",
        "timestamp": "2024-09-23 21:41:48",
        "total_reactions": 65
    },
    {
        "username": "Page307",
        "content": "I’ve been trading with Ethan for a couple of months now, and I’ve been incredibly impressed with his expertise and teaching ability. He has a unique way of breaking down complex trading concepts into digestible pieces, making it easy for even a beginner like myself to grasp.\n\nOne of the things I value most about Ethan is his real-time coaching. He guides us through trades step-by-step, explaining his thought process and the rationale behind each decision. This has been invaluable in helping me develop my own trading intuition.\n\nBeyond his technical skills, Ethan is also a great mentor. He’s always patient, supportive, and willing to answer any questions we have. I feel confident that with his guidance, I’m on the right path to becoming a successful trader.",
        "timestamp": "2024-09-23 20:27:45",
        "total_reactions": 11
    },
    {
        "username": "lordjellysneeze",
        "content": "Ethan is one of the best guys to trade with in the morning. He holds himself accountable and really explains his trades in the morning before he sets it up. The coaching is next level even when we are in the middle of a trade he gives solid play by plays so you feel comfortable taking profit or getting out if the trade goes the wrong way. Been in a couple other trading discords and only prefer this one because I’m not trying to trade all day. I want to be in and out and done with the market by 10am MST no matter what. Ethan explains why day traders need to find a strategy and stick to only that strategy and walk away for the day. It all makes sense if you just follow his direction. I use to take every trade I could afford and it worked against me until Ethan emphasized take a trade and walk away. Your win ratio will start to change. It had since. Couldn’t ask for a better mentor than Ethan because of how smooth he is with his information.\n\nEthan is one of a kind and is personable and won’t blame game he makes and over complicated system seem really straight forward and easy. Because it should be that easy.",
        "timestamp": "2024-09-23 20:25:48",
        "total_reactions": 8
    },
    {
        "username": "Vanz",
        "content": "I have had the pleasure of working with Ethan since May, and I can confidently say that he has been nothing short of exceptional. His expertise in trading has greatly enhanced my understanding of the market, as he has taught us crucial strategies such as how to identify optimal setups, size our trades appropriately, and effectively scale in and out of positions.\n\nEach week, we discover new concepts that we can immediately apply to our trading practices, making the learning experience both dynamic and enriching. Trading live with Ethan has been incredibly rewarding and his guidance has been invaluable. He approaches each trade with a clear set of criteria, ensuring that we only enter positions that align with our strategy, which significantly boosts our chances of profitability.\n\nWhat I appreciate most is Ethan’s ability to help us maintain our composure, especially during larger trades. This focus on discipline has been instrumental in maximizing my profits. Additionally, he is always responsive in our chat group, taking the time to answer questions and provide support when needed.\n\nOverall, my experience with Ethan has been fantastic, and I wholeheartedly recommend his coaching program to anyone looking to enhance their trading skills.",
        "timestamp": "2024-09-23 20:11:00",
        "total_reactions": 11
    },
    {
        "username": "SailorBrown",
        "content": "As a Lifetime member of Pennybois, I've found everything I need to succeed in my trading journey. They provide exceptional education that equipped me with the knowledge and confidence needed to navigate stocks, options, and crypto effortlessly. The staff's expertise and support have been invaluable, and I've gone from a novice to feeling fully equipped to tackle the market. Whether it's long-term investments or day trades, Pennybois covers it all, making it the go-to choice for anyone serious about trading success.",
        "timestamp": "2024-04-04 18:31:37",
        "total_reactions": 190
    },
    {
        "username": "Kiaris",
        "content": "I dipped my feet into the stock market for the first time in July. No plan, no strategy, just wanted to see what it was like. I very quickly lost 28% of my investment. I joined the free pennybois in September, and was immediately able to put the knowledge to use. I realized that I need to be extremely careful with the panic selling. After going Premium for a month I have gone from being down 28% to being within striking distance of being back to even. A huge part of that was the knowledge I gained from their Options education. but also just learning that it's ok to go at a slower pace. I see people say they make huge gains on SPY, and being new, I'm just not ready for that yet. Through Pookie's series and additional education, I've got a plan that I am slowly working on and don't have the sense of dread when I see a dip happening.",
        "timestamp": "2023-10-15 22:37:51",
        "total_reactions": 144
    },
    {
        "username": "Jrmiller78",
        "content": "I have been a member for a few months now, and every question or issue has been answered or taken care of promptly. I was skeptical at first as I am sure most were, but immediately after joining all that went away. These folks really care about each individual learning and succeeding. The best part I found is you can learn at your own pace, there's no pressure to do anything. If your having trouble grasping a certain concept they will work with you until they figure a way that you can understand. I am amazed how the site is ran and the community feel to it. Everyone is simply there to help each other and make money trading. It does not matter the size of your account or much trading you do, they treat everyone the same. I have asked many questions since joining and every single one was answered asap, and not once have I ever felt like I didn't belong due to my knowledge. Literally within the 1st few days the subscription fee had been covered by profits. There is so much that they offer I am still finding new things every day. It truly is our own little stock trading, and sometimes just hanging out club.. I just wish I would have pulled the trigger much sooner, a day trading without P.B in my opinion is a wasted and much more risky  day. Thank you Wonderful folks at P.B for providing the service it truly is amazing.",
        "timestamp": "2023-10-11 20:51:41",
        "total_reactions": 120
    },
    {
        "username": "Centenal_Black aka Doji Cat",
        "content": "Started with SNOW based on notifications and I have been trading 50 shares for the last couple of days with trailing stops. I’m sill learning but thanks to what I have learned in the premium membership I have stepped away from the trade and kept enough profit to pay for the premium membership for 4 months 😀. I’ve only been a premium member for a little over a month and my accounts have stopped bleeding and are on a steady recovery trend.",
        "timestamp": "2023-10-11 16:28:41",
        "total_reactions": 68
    },
    {
        "username": "Maestro3188",
        "content": "Hey everyone, I joined this group back in March very inexperienced in many ways and also very stressed in so many more ways especially with my trading. This place has provided me with a variety of tools in trading and in my personal life. This is an absolutely wonderful place to be providing you take the time to actually learn what education that the team provides and even the traders inside the community. 100% recommend to anyone who is thinking about getting into the stock market. Biggest thanks to all of PB and PBU you have been one of the shining lights in this world!!!",
        "timestamp": "2023-10-08 15:36:11",
        "total_reactions": 68
    },
    {
        "username": "Kseniya",
        "content": "Hello everyone, I would like to share my Experience in PBU, at first I was a memeber in the past and never really took advantage of this group. I decided to join recently the premium after really huge huge losses. I reached out to Nikki just end of September to guide me which directions to take as I was about to quit trading 😿 thinking it’s not for me. She found a time to talk to me over the phone. She sent me different resources classes 🙌 took her time to set my mind rather on smaller gains and not have FOMO. Everyone is super helpful when you ask questions. This is one of my best decisions. Just 10 days later I started taking small daily Gains and already recovered some of my losses. \nThanks a lot PBU🙌",
        "timestamp": "2023-10-06 20:58:52",
        "total_reactions": 35
    },
    {
        "username": "bDiddlyD",
        "content": "I guess I’ll start by saying thank you to the PB Family. Thank you for all of the support and teachings. I stumbled onto this community by accident back at the beginning of 2023. I had been losing money on silly meme stocks and crypto’s because I heard about the hype after the hype was over. Then I started hearing about how much money people can make trading stocks. I wanted to learn. Started googling how to learn stock market and PB happened to pop up. I took the chance and joined up. The first couple of months, I learned a little (not as much as I should have), didn’t take the advice of paper trading, and lost a lot of money. I almost quit. I wasn’t seeing the results I wanted and I was angry. But. I sat back and thought about everything. I realized I wasn’t holding myself accountable. I wasn’t really putting forth the effort of learning and applying what I’ve learned. I wasn’t paying attention to the psychology side of trading and I wasn’t paying attention to how my weaknesses were affecting my trading. Once I realized all of this, I was able to slow down, drop the expectation of hitting that one big stock run, and really see where I messed up. Now I’m starting to climb back out of the hole I’m in. I’m still not in the profit. But I’m a lot closer than I was a month ago. I set my goals, I set a ‘5 year’ plan. And without this community of amazing people, I wouldn’t have had a chance. I truly hope this helps someone that is looking to start, or even someone that might be experiencing the same things I did. I promise you’re not alone. No one wants to see anyone fail. Everyone wants to see success. This group is everything a new trader needs. From psychology, to basic fundamentals, to advanced technicals. I would love to see this community continue to grow. And I plan on sticking around for a long long time to see that growth.",
        "timestamp": "2023-08-20 17:16:24",
        "total_reactions": 56
    },
    {
        "username": "Devastator",
        "content": "What they taught me is that trading is about managing risks and emotions, while learning how to invest with patient confidence. That’s hard to do in our world of endless distractions, unless you have help - Learn from experts and educate yourself. Also, trading can be a very bad experience if you are always alone, and the community that Pennybois provides is the best part. They have educators, counselors, live streams, 1-1 training, a thriving discord and website, Crypto traders! and lots of content, and most of all education. I do want to mention that they help all levels of traders too, they do an excellent job of giving content to all levels of traders and investors. It took them a long time to win me over, but obviously I’m writing this testimony because this has been one of life’s good surprises for me, and I want more people to experience what they have to offer. No one should have to work their whole life away; and even though I don’t know you, I hope you find a way out of the rat race too.\nI’m still not a full-time trader, but dreams without goals are just dreams.",
        "timestamp": "2023-06-06 19:19:23",
        "total_reactions": 95
    },
    {
        "username": "Devastator",
        "content": "I’m writing this in the hopes of helping someone who dreams of being a trader or independently wealthy, perhaps my experiences can help you. I have a job, but I always dreamed of being self employed as a stock trader and building generational wealth. After years of losing money trading on Robinhood, I decided to get serious and gain some education on trading stocks.  It took reading many books on investing, before I realized that the only way to make it as a trader in the modern age was to have an edge over the many hedge funds and algorithms trying to work against me. Lucky for me, I stumbled upon the PennyBois Free Discord section, through a Facebook investing group I joined last year (Just joining that free discord saved me thousands of dollars). If you are still reading, remember this, the market is designed to steal your money – from the news articles to YouTube videos, to twitter. There is so much misinformation and manipulation, you aren’t at fault for losing money. \nThe only way to win is to educate yourself as to what is really happening, otherwise you are just gambling. Pennybois offers free trading courses and even provides some basic guidance for new traders for free. It will become obvious to everyone that they simply want people to thrive. I quickly realized I wanted more education and joined their premium service, and the content is top quality. I advise anyone who knows nothing about trading to join their free discord, there is so much content and support, it will amaze you. It has been a rough ride for me, and I am learning more every day, but the knowledge I have gained will last a lifetime. I also don’t trade alone anymore, and most of all, real time trading and training is what matters most to me, this market changes so quickly, you must stay on top of your investments and be prepared. After writing this, I’m really disappointed I didn’t reach out for help sooner, I could have saved a lot of money in the market.",
        "timestamp": "2023-06-06 19:19:06",
        "total_reactions": 0
    },
    {
        "username": "KyoCJ🐳",
        "content": "Well, my first testimonial for anything, bit nervous, but here it goes. I joined PB family for about 6 months now, When I started I  was looking to try out options trading. Of course I treated options like gambling, not knowing how to look at charts, support/resistance, 100% pure luck, and like gambling, it burned my account. Then I took the PBU course on my own time, spend time to look at analyst ideas and compare to what I have learned. It's definitely work, but it definitely pays off, Everyone is always so nice to help, doesn't matter what types of questions, there will always people answering. Their main concern is really to  help everyone grow. Thanks to PB, I'm definitely on the right path towards financial freedom, looking forward to a bright future with PB. ❤️ ❤️ ❤️ ❤️ ❤️ ❤️ ❤️",
        "timestamp": "2023-05-25 18:23:01",
        "total_reactions": 48
    },
    {
        "username": "Zach’sLizard🥳",
        "content": "I’m maybe guessing some of you want to to hear my story? But I’m still writing it lol! I have gone through most of these testimonials and I’m like, damm. How am i gonna top these? Or like, not even top but how can mine be different from everyone else’s? I’m realizing most our story’s are the same but it’s you that makes them unique sorta say you know? Because everyone has a story, and not everyone is the same. I have been trading since 2020 and I’ve found myself In PennyBois multiple times. Yes, i said it. Multiple times because i had left a few times because i had destroyed my account twice. I blindly followed trades for a year not knowing what i was doing and went off of emotions almost 100% of the time. I didn’t take the time to learn a plan and an exit strategy and in general had no clue what i was doing in the overall market and lost over $5k in Robinhood. I can say i realized that there was a ton of research and learning to be done and that it was gonna take some time but little did i know that there was actually a whole lot right in here in this discord. This discord is like a gold mind or the pot of gold at the end of the rainbow. There’s always tons of people to answer your questions if you’re ever in need. They’ve helped me a lot over the years and I can’t thank them enough. Truly this group, team and family we have here, is absolutely amazing and will always be the best of all time in my book as we push forward to help one another. I’m in a better place than what i was in, most definitely after watching over a ton of videos that they have posted and pinned here in the different channels. And i want to keep this short because Ik it’s looking like a paragraph or an essay but you’ll come to understand that “knowledge is the treasure of a wise man.” – William Penn. I still can’t thank PennyBois enough for all they’ve done and showed me. Thank you again so much!🙏🙌💪🏻🤙🏻🥹❤️\n🥳🥳🥳🥳🥳🥳🥳🥳🥳🥳🥳🥳🥳🥳🥳🥳",
        "timestamp": "2023-05-08 17:30:40",
        "total_reactions": 20
    },
    {
        "username": "🌴💛._MAX_.💛🌴",
        "content": "I've been with PB for a few months now. I have learned more in that time than I have in years of trading and taking losses. I've wrecked my account so many times was about to give up before I came here. I have been following Amma's plays and love the informative live streams! They whole PBU staff is amazing and truely wants to see their members succeed. The dedication and time the shotcallers have taken to create such an amazing environment is truely something special. I bought the year premium and have made what I payed back plus some. I'm excited to continue my journey of growth and learning to bring in an extra stream of revenue. Extra special shoutout tho to Amma! Your style of trading is exactly what I was looking for. Your so amazing and kind and always happy to answer questions and even walk through trades. I could go on and on about the benefits. If I could go back in time I would have joined PBU sooner. Not a moment of regret since taking the leap! Thank you again PBU for everything you guys do for us! <:the_way:754180893068755025>",
        "timestamp": "2023-05-01 19:33:03",
        "total_reactions": 24
    },
    {
        "username": "itsmissdani",
        "content": "I’ve been with PB now for just over two months and could absolutely not be happier. Like many people, I started off my trading journey with a rocky start, I very quickly lost a good chunk of my portfolio which was super disheartening. I was thankfully able to reassess which strategies I could follow best from the shotcallers here in PB and since have been able to make all of my money back + an extra 10% in the last month!  The admin are almost always available to help you with anything you need, they want you to succeed perhaps even more than you do sometimes. The team here is more of a family than anything and the wealth of knowledge you receive from them is worth the cost of premium alone even without the alerts!",
        "timestamp": "2023-04-16 15:32:52",
        "total_reactions": 24
    },
    {
        "username": "Moofu",
        "content": "Just to go even further for those who may be on the fence!\n\n - How would you rate your trading confidence and financial security before joining PennyBois Trading Community?\nTrading confidence was about a 3/10. Had a false sense of confidence that I had knowledge on how to read charts but beyond that, I knew my trading knowledge was no where near what it should be. Financial Security about a 5/10, I work a job now that is secure but doesn't pay great, it pays the bills but not much is left over to make us feel secure, enough. So that is what spurred me to make the PB jump because trading has always been a desired passion of mine because I would absolutely loveeee it if I could make this my full-time and my job now a part-time.\n\n - How has that changed since you joined?\nMy trading knowledge has shot through the roof after joining PB. From PBU to the YT and just the chat and listening to SLP, Amma, Quench and everybody, it has really opened my mind to the world of trading. Financial security I would say would be a bump from a 5 to a 6/10. Very positive, but not a huge bump because I am still playing with a small account. Just being honest, I started with $150 in the account and now its grown to $604 yesterday. My next goals are $1k, $1.5k, 3K, then $5k and once I hit there, my security will feel better and my willingness to play with more money and bigger boy trades will be there!\n\n - What would you tell a new trader that was on the fence about joining?\n\"You miss 100% of the shots you don't take\", take the leap and you will thank yourself! If anything, try it for just one month and you will see the benefits. If you apply yourself, learn from PBU and all of the learning materials offered, you will make your money back with ease!",
        "timestamp": "2023-03-22 19:31:00",
        "total_reactions": 15
    },
    {
        "username": "Moofu",
        "content": "The family here at PB is awesome! The team is wonderful and are willing to help you learn and become a knowledgeable trader. The community is huge and everyone is welcoming and a blast to talk to. Myself, I started with a small account to only play with what I can afford to lose and take time to really learn and take advantage of PBU, but in not even 3 MONTHS, I have tripled my account from the help of Pennybois and their alerts! I look forward to every trading day and hope to be a lifetime member soon!",
        "timestamp": "2023-03-22 15:54:58",
        "total_reactions": 12
    },
    {
        "username": "bill_1031",
        "content": "The program is very straight forward, follow directions, learn from the professionals, make money, repeat. I got back into trading a little while ago and was pleased to see I had broken or simply fallen out of the bad habits I accrued when trading previously. But I was still barely making money, 3% here, 5% there, then a bad trade would wipe out all my progress… I finally caved, signed up for premium, and couldn’t be happier with the results. I’ve added 10% to my portfolio daily and have already made more than I paid to be a part of premium. If you’re on the fence about premium, just do it, it’s absolutely worth it. 💰💸",
        "timestamp": "2023-03-08 23:45:57",
        "total_reactions": 15
    },
    {
        "username": "Tic - Breezy (Lets Gooooo)",
        "content": "I'm not going to give you a story about my trading journey as its similar to everyone else  first you suck  and that's either the end or a new beginning you either quit or become obsessed. I've been part of this group for going on two year's  most everyone that see's these or reads them Knows about the amount of knowledge tucked away in here.  I don't care what your style or specialty someone's doing it and doing it well. I have only joined up in two other discords and all it was about is shit talking and guys trying to get paid  for advise or trading tips, there was no sense of community or team. needless to say that didn't last long  When i joined this one I quickly found out that Regardless of status in this group everyone is on the same page, Getting knowledge, sharing  help, getting consistently paid by the market...  The amount of support and encouragement is off the charts.  I could give you a hundred examples but i would end by saying come over and try it.. It don't cost a thing  but some time, ask some questions tool around and see for your self..    we have nothing to hide there's plenty of money to go around  if your struggling to do this and we all do  there is certainly a tool in this bag to fix it.",
        "timestamp": "2023-01-28 13:12:03",
        "total_reactions": 45
    },
    {
        "username": "katelyn7099",
        "content": "I had dabbled in stocks for several years. I’ve always been curious about it and wanted to learn. However, when I started with stocks I was just going in blind. I would try to search and figure out things, but it seemed to only confuse me more. I had saw ads about this group, but I wasn’t about to waste my money on something I had no idea if it was legit or not. Then a friend of mine started posting about how he was doing with his stocks. CaptainOfConsistency asked if I had ever done options. Ummm absolutely not I have no idea what that is. So we talked for awhile about them. I learned a lot from him, but he told me about this group. Finally I gave in and said I would give it a shot. I’m so glad I gave in and chose to do something for myself for once. I’m constantly going back and looking at classes to see what I may have missed the last time. I try to watch the streams as much as I can. I work full time and I’m a mom of two. It’s not always easy, but I refuse to give up. \n I have completely blew my account several times trying to learn. I keep getting better, but I know I still have a lot to learn and adjust. I’m constantly paper trading Options I choose for myself and the shot callers as well. Looking at charts, choosing an option, and then watching the chart and how they react differently. \nThe live streams where I am watching them chart and getting to hear them explain help me the most. I’m so thankful for this group. I get frustrated with options when I’m not doing something right, but can’t put my finger on what it is. I take breaks from options when I get like that because nothing will go my way till I learn and figure out what I’m doing wrong. I go back to equities and do those for awhile. I’m always in the back shadows of this group(thanks anxiety), but constantly online and looking. O.G.Nikki is a blessing to me. She’s so patient and kind with me. I say reach out to her and try it for two months at least! Take it slow and learn is best!",
        "timestamp": "2023-01-26 14:15:06",
        "total_reactions": 25
    },
    {
        "username": "Portgas D Ace",
        "content": "A buddy I used to work with actually got me into trading and I saw pennybois ad on facebook and was very interested. I’ve been apart of pennybois for about 3 years or so and it has been life changing the people here help you learn not just about stocks and options but about who you are as a person. It’s not just the shotcallers also but others who know exactly how your feeling after losing a trade or having high anxiety before getting into one because they’ve been there and done that and help you learn to not do those mistakes again. I’ve learned so much about myself from joining pennybois and watching ammas livestreams and listening to what mr.slp and swingingbull talk about and want to continue to learn because my goal is to do this full time! I still have my bad days but every trader in the world does but that bad day is just a learning experience for you and as long as you don’t give up on yourself just because of a bad day or week and having faith and believing in yourself is a step in the right direction which is one of the biggest things I’ve learned and am still learning about myself. If your a free member and have been having doubts about this discord group I highly suggest joining you won’t find another group like this one!",
        "timestamp": "2023-01-26 01:21:30",
        "total_reactions": 22
    },
    {
        "username": "Big Daddy Mouse",
        "content": "All I can say is JOIN! I saw this discord advertised on many stock pages. Working hard on my own I had built a 3.2 million dollar account only to have it nuked when trusting it to a financial advisor. I knew I needed help so with my last bit of money 50k I joined. My very first trade with PENNYBOIS netted me a 60k profit. I watched the videos in the PBU and am learning every day. not every trade is a winner but what they have taught me is minimizing my losses and making me more profitable in the long run. I cannot say enough good things about PENNYBOIS. A few more trades and I will be buying the lifetime membership. Joining is already paying dividends 😉",
        "timestamp": "2023-01-13 22:54:09",
        "total_reactions": 45
    },
    {
        "username": "marlon1234",
        "content": "JOIN, JOIN, JOIN!!! I have NEVER written a testimonial or provided feedback for a service or company. However, I had to do it for  Pennybois discord! This discord is the cheat code for financial independence. If you follow their trades, it is IMPOSSIBLE not to make money. I will not say what I started with, but it was under 5K. The thing is,  I signed up for their two week trial about a week ago and already I made the yearly membership fee several times over! JOINING PENNYBOIS IS A NO BRAINER!!! No matter what you start with, you will make it back in the first week IF you follow what they say. YOU CAN THANK ME LATER!",
        "timestamp": "2023-01-13 22:25:11",
        "total_reactions": 23
    },
    {
        "username": "k15goose",
        "content": "Hey guys, I thought I'd finally give my testimonial. I've been watching this group for more than a year and finally pulled the trigger on some options contracts last week and made a small profit! I was nervous for the longest time and for no reason! I'm a newbie to trading options so I definitely like to take things slow but I'm so excited to finally get going and anxious to make those high % profits I see everyone doing everyday. \n\nThe culture is amazing, the admin are friendly and knowledgeable, and everyone wants to help you succeed. Also, I'm 99% sure that every shotcaller plays what they alert which is so different from every other group I've ever heard of. \n\nIf you're on the fence about joining PB, don't be! Just subscribe and get started! I put it off for way too long and wish I hadn't waited as long as I did. I gotta give a special thanks to Nikki. She helped me so much from the very beginning to setting me up as a lifetime member!",
        "timestamp": "2022-12-13 00:25:23",
        "total_reactions": 33
    },
    {
        "username": "Kiryuu1",
        "content": "I started with crypto trading and was doing well in that and decided to try my hands at stocks. Without any guidance I went and tried to learn it as I go. That was a mistake, not knowing how things worked especially in options, not doing due diligence, not protecting profits costed me a lot. I decided I needed help somewhere and ended up here after trying a few others. At this point I was down 18k and at first I was making use of PBU but somewhere I slacked and somehow went back to my old habits. I at this time was on a roller coaster. I probably should of done the 1 on 1 mentor but instead I just took a break for a few months. Came back here again because I saw everyone's success and downfall but the group continuously was supportive. I saved a bit more and started with 3k and went slow. On the first day back I made up the 3 month sub. A month later they offered a great 1 year deal and I made that within a week plus more. I definitely changed my style to protect profits and stop trading so much on emotions. I do this on the side for fun and this has been a fun group even if I barely talk on here. I will say everyone here has been awesome and the education here is priceless. At least to say I am up 400% since I rejoined and close to recovering what I lost only in a few months. I'm very thankful to Amy and Mr SLP as I follow them the most. Once in awhile I'll take Patricks lotto plays and when he hits its insane. I don't see many groups hit as much of their option plays like these guys. I've been in 5 groups. Small gains but nothing compared to these guys.",
        "timestamp": "2022-11-30 21:43:16",
        "total_reactions": 17
    },
    {
        "username": "ufo",
        "content": "I started my trading journey in 2021 following a guy who posted phenomenal day trade hotlists everyday. I did pretty good off his plays, but really had no idea what I was doing, just watch for it to pop, buy, and get out quick. Sadly he left the trading game and I was without a mentor. I floundered around and made some trades here and there, but could never replicate the success. Fast forward to a few months ago and I was invited here to the discord group. I joined for free and quickly saw that the free trade notifications where legit, and successful. After reading around the discord I found that this was exactly what I was looking for. I decided to make an investment in myself and my future and bought a premium membership for a year. Let me just say that I am far beyond satisfied with my decision and would not change it. I have learned so much here in a few short months, and everyday I learn more. The PBU university is great, it teaches everything from psychology to indicators, risk management, and so much more. The premium alerts in and of themselves are well worth the investment in premium with alerts for day trades, swing trades, otc, crypto, retirement plays, and of course all the juicy options plays you could ever desire. I'm now on track to make significantly more than my investment for a year of premium service. What I consider the real value though is the knowledge I am gaining. Instead of just taking the alerts blindly I now understand how to analyze the chart, use the indicators, and when the good times are to both enter and exit the trade. Through this amazing group I am learning to be a competent trader and investor, and the knowledge I am gaining will be able to help me make trades to supplement my income for the rest of my life. I'm not looking to get rich quick, what I am looking for I have found. A place to help me grow my knowledge and support me in my passion and pursuit of investing and trading.",
        "timestamp": "2022-11-27 02:09:31",
        "total_reactions": 19
    },
    {
        "username": "BuckWild",
        "content": "I started trading in 2020 with a group of friends at work. We began to trade energy companies we were familiar with and one day a coworker joined our group and told me about PennyBois, this super exclusive group of traders that could only be joined by invite (this is literally what he told me). So, I had to join this group to see what the hype was about. I jumped into the free section of PB in Sept 2020. The free classes and live streams were great! I learned quickly that PB was about trading responsibly. PB is a group of professionals that are committed to help the every day person succeed in the stock market and learn as much as they want to at their own pace. I was hooked and really enjoyed the free section. Then one night I won a raffle for one month free of Premium. Wow is all I can say. I could not believe I stayed in the free section for so long! I went through PBU, wrote my trading plan and got to work. I earned plenty to pay for my premium membership. Now here I am and have done so well. I started thinking about the cost of premium and the profits I have made which far exceed the cost for lifetime membership. That coupled with the fact I can’t say enough about the PB staff and the amazing culture of caring about people and helping anyone to succeed in the market and in many other aspects of life. Quench pours his life out to helping others with habits, hang-ups, and addictions. Each shot caller personally cares about every member doing well. The support staff are amazing. So, why would I not join lifetime membership? There is no reason why not. So, I did it, and just like when I joined premium, wow! I now have access to all that PB has to offer and it already has profited me greatly. This was an easy, no brainer investment. Everyone in this community is committed to one another’s success because of the culture that was intentionally created. What a great community to be a part of. And the best part is, everyone is invited! Thank you Pennybois!!!",
        "timestamp": "2022-11-11 19:02:31",
        "total_reactions": 25
    },
    {
        "username": "Jefe",
        "content": "I started trading in February 2020. Started off pretty good. I was making what I thought were good gains. The market came tumbling down and due to my negligence and lack of a solid trading plan I went from green to down 70 percent all time. I wanted to \"keep playing the game\" so I fomo'd a handful of plays from WSB Facebook page and absolutely got hammered... I wanted to quit and just give up but I seen someone advertise the pennybois group a few months ago. I figured it couldn't get much worse so I gave it a try. My first play from the group was one that PP posted. I forgot the play but it made me a few hundred dollars in a matter of minutes. I was super impressed and stoked. I kept sticking with the group and developed my own trading plan. I found what works for me and what doesn't. I am without a doubt still a newbie to this game with so much to learn but with the help and knowledge of this group I have improved my account 75 percent in the last month. I'm absolutely ecstatic about that and I know it's all up from here. Everyone in this group is helpful and are eager to help you just like they helped me. Thank you to everyone who made this group possible and thank you for continuing to kill it and spread knowledge. I sincerely wouldn't be where I am without you guys and gals. Y'all truly are the best! Have a green day everyone ❤️",
        "timestamp": "2022-11-10 15:22:09",
        "total_reactions": 27
    },
    {
        "username": "north8869",
        "content": "I started trading in January 2020 and, like everyone else, I very quickly grew my account. However I had some difficulties come up in my personal life and I lost it all. I was so close to quitting trading. But then I found Pennybois.\n\nOver the last couple of years, I joined many different groups and they all unfortunately led me to lose more money than gain. Once I found out about Pennybois, I joined right away. At first I was skeptical, asking myself “what am I doing? Haven’t I lost enough money already?” So I canceled my membership and got a refund. To my surprise, they were nice enough to contact me personally and ask me to give them a another chance after explaining more about the group to me. Boy, I am so glad I said “YES” and gave them another chance. This group is nothing like anything I’ve tried before. They are more like a family than just a trading group. They care about others so much and for the first time I have actually learned how to trade rather than just react to an alert without knowing what is going on. It is the first group where as soon as I ask a question I get an answer right away, no matter what. Everyone in this group is amazing, but I have to give a shout out to Mr SLP, Amy, Nikki, Mr PookiesRevenge, Patrick and so many others who made this group even more special. I had made a promise to my husband, who unfortunately was recently diagnosed with a terminal disease, that I was going to make this work, and this group has made it happen. Thank you Pennybois! ❤️❤️",
        "timestamp": "2022-10-26 22:05:22",
        "total_reactions": 39
    },
    {
        "username": "DrMalpractice",
        "content": "Been a PennyBois member for over 2 years.  First and foremost this place is a Family. A community. A home from home. Wrap this up with a top class trading education and some hotter than habanero alerts and you have yourself the secret sauce of trading groups. Never leaving! Come join us. Don’t trust it? I was nervous too. Just hit the FREE SECTION and see with your own eyes. You won’t regret it. See you there. ❤️",
        "timestamp": "2022-10-13 20:43:49",
        "total_reactions": 26
    },
    {
        "username": "Scrotus McDingle",
        "content": "So, I had no idea what I was signing up for when I started with PB around two years ago. Was very skeptical at first. Started with the free side and that didn't last long after seeing the alerts and the consistent success the shot callers were posting. Then I joined premium and realized I really have no idea what the hell I'm doing and while everyone else was posting gains I still manged to be rather unsuccessful. Now this is about the time PBU was rolled out in beta form so I jumped on the opportunity of the free education. Then I went through the first actual class of PBU. Enjoyed both of them and in those courses is when I started to get an idea of what this group was all about. Got the sense of community and family from the instructor What the duck as well as from the rest of the individuals in the class. We were all learning and growing and helping each other out. I was realizing that all these people in this group genuinely care and wanted to see everyone else do better and be successful in this. Now after being here for the time I already have and knowing that I had no plans of going anywhere when they offered the lifetime membership it only made sense. Looking forward to see what Big quench and the admins have in store for us all! So a huge shout out to all the shot callers, admins, moderators and everyone else that works behind the scenes to continue to make this already awesome place grow and change for the better everyday. Thank you Pennybois!",
        "timestamp": "2022-10-10 22:31:01",
        "total_reactions": 32
    },
    {
        "username": "BErt",
        "content": "in may-aug i went from 300-1000 and because my account had a liquidation warning on it, i opened a new account and from aug-now i transferred 1047 to my port, currently sitting just above 1,300 🙂",
        "timestamp": "2022-10-10 21:49:20",
        "total_reactions": 9
    },
    {
        "username": "BErt",
        "content": "i dont know where to begin because everyone and they're mom will be able to see this so ill just spill the whole can of beans, I'm an open book. I've nuked my account three times and i never blamed myself always the market or some random non existant entity, I never gave up tho, i was just oblivious because of my own ignorance. PennyBois has saved me. The amount of knowledge I've obtained cant be compared, seriously you will learn everything you will need to know. I started the first few months just doing PBU and absorbing all the knowledge i could from shotcallers and i dont regret it. I've learned so much, charting, indicators, risk to reward, etc i could go on.  So far, from the things ive learned, ive been able to gain somewhere in the ballpark of 200% in ab three months, another 100% is from the shotcallers help/alerts. I wouldnt want to be anywhere else but PennyBois, its a family, i finally feel accepted by a group of smart people who are actively trying to help people. Im so happy i found pennybois<:SCWLSD:750768558975484065>",
        "timestamp": "2022-10-10 21:46:26",
        "total_reactions": 22
    },
    {
        "username": "Gator2020",
        "content": "Are you new to trading?  Have the desire to learn and put in the work? The Pennybois trading community provides the best staff, shot callers, and educational material to help you grow your trading skills and portfolio. No reason to be hesitant or shy here.  The staff have cultivated the most supportive culture to help you succeed and grow, and important to me, trolls and negativity are not tolerated.  Members try to help each other and staff are very responsive to any individual questions or inquiries.  Multiple live trading sessions are held weekly. My trading journey has evolved from true beginner over a year ago, to now being able to confidently chart and play Scalps, Day Trades, and Swings , whether equities, options or crypto.  I have now learned how to trade, trading psychology awareness, scaling in and out, identifying less risky trade entry/exits, risk/rewards and more importantly, what NOT to do. Without PB, I would have blown up my account within a few months of starting. The resources are here to reach your goals, whether starting with a small or large account. Only limitations are up to you.  Slow and steady growth, compound gains to the moon!",
        "timestamp": "2022-10-10 21:45:33",
        "total_reactions": 12
    },
    {
        "username": "SAIL",
        "content": "Pennybois saved my life, i was down 5000$ on robinhood with my poor choices that I made. I learned from Nikki that you shouldn't be greedy with the market and go for a low goal of a percentage every week, and look, I turned my losses slowly into gains. Now I'm up 9% in the past 2 weeks and up almost 4% this week. Which is great. I went all the way down and lost a lot in the process, but now that I learned the best way to trade things have changed and it really has impacted me and my trading journey. Thank you to @o.g.nikki for being there every step of the way and helping me when I needed it. Without this server I would had quit trading stocks for good. But I'm turning it around. Thank you pennybois 🙏 Make wise choices and don't screw up like I did in the beginning, take the time to learn!",
        "timestamp": "2022-09-12 20:06:45",
        "total_reactions": 65
    },
    {
        "username": "Mattster42",
        "content": "I am so blessed to have found Pennybois. I traded on my own for years. Sometimes very successfully but more often than not, I would give it all right back. What **WE** are building here at Pennybois is truly innovative. We are building a community for the little guy. But this place is more than an outlet to distribute killer alerts. They ABSOLUTELY do that, but I have been in other groups that boasted and provided big gains. ***Though this place has developed the BEST day trading shot-calling group out there. The gains we are seeing are off the flippin charts consistent!!*** This place for me is more than a top notch trading education and mindset center. They ABSOLUTELY provide that, but let's face it, YouTube is chock full of educational channels and channels helping you to work on your mindset. ***Though I am not sure I have ever seen a course with as much technical / mindset / planning / strategy in one spot!!*** So what is so special about Pennybois? There is a fellowship here I've not found anywhere else. You can ask any one of the shot-callers or admins and they will set aside time to work with you one-on-one. Seriously. They have helped me uncover some of the things that have held me back for ages that I never knew were there. They support this community and ***anyone and everyone*** who is willing to put in the effort and ask for help.\n\nAfter years of struggling, I feel I am finally on a path to financial freedom and eventually generational wealth. I learned more about myself here than I thought I would, and that has made all the difference. Thanks for everything! Much Love!",
        "timestamp": "2022-09-03 22:09:01",
        "total_reactions": 60
    },
    {
        "username": "AgentPenguin",
        "content": "I must say Pennybois has been the best thing I have accidentally stumbled upon. Although work can be hectic, the alerts here have helped me to pick a few tickers to observe rather than having to do everything by myself. There's all sorts of alerts to cater to any type of traders. They even have some watchlists for those that would like some preparation! The shotcallers/ admins here help create an exemplary community for trading and creating a family within. There's always plenty of opportunities to jump into a day trade! If you don't know how to day trade- fret not, there are plenty of people in the community to help along the way! I've made myself home here forever. Much love to everyone here. Let's learn and make some money! <:cuteheart:942826914769416273> <a:money_bag:865379673616416768>",
        "timestamp": "2022-09-03 02:41:01",
        "total_reactions": 22
    },
    {
        "username": "Shushy",
        "content": "Everything I know about trading I learned from Pennybois and\nPennybois University. These trainers and shot callers work tirelessly to deliver solid alerts and give us the education to know how to play them. I've got my stocks that I like trading, and ones I'm in for the long term. But what I really like to do while I'm holding those stocks is day trading options. These options alerts are straight 🔥FIRAH!!!🔥\n Especially the day trade alerts. When I was only trading stocks, having a 100% runner was a huge deal! But with the Pennybois options shot callers it seems to be a regular thing. \nPlenty of times on red market days the only thing keeping my portfolios in the green was options day trades.",
        "timestamp": "2022-09-02 20:37:57",
        "total_reactions": 21
    },
    {
        "username": "BigDaddyNHM",
        "content": "I been here for a while and started off with longer trades, but I love day trading here at Pennybois! I can pop in for a few minutes while on break or a conference call and usually catch a fast trade without having to babysit it all day. Often they keep on running after I profit.  The alerters are so on fire even the swing trades sometimes turn into day trades. I'm never leaving!",
        "timestamp": "2022-09-02 20:14:40",
        "total_reactions": 17
    },
    {
        "username": "jonb3739",
        "content": "Been on pennybois for 3 months and can honestly say im impressed. I have learned alot through this group and will only continue to grow. Sometimes trading psychology gets the best of me but im slowly identifying my faults and strengths thamks to PBU. Just this week had a 100% and 250% trade. Thanks to pennybois. Ill continue to follow pennybois!!! 🔥 🔥 🔥",
        "timestamp": "2022-09-02 02:08:00",
        "total_reactions": 27
    },
    {
        "username": "csmith5522",
        "content": "Just want to give a shout out to all the penny bois and gals here who have been working everyday to make sure we stay informed and stay on top! Before I came here I had lost about 78% of my account, but now with the help of my mentors here at pennybois I have began seeing consistent profits. So once again, thank you for giving me proper education and showing me how to be a successful trader.",
        "timestamp": "2022-08-17 21:26:00",
        "total_reactions": 49
    },
    {
        "username": "skydivingfool",
        "content": "I really just wanted to take a minute and thank this community, especially OG Nikki and L.T. I started my journey in trading months ago. I got lucky, made some money, and then I lost more then I like to admit or say out loud. It was great at the start when I was making money (knowing now this was just being lucky), but once I lost way too much money I got so upset that I lost interest. I work 50 hours a week in my corporate position, and recent jumped into a food truck with my family, so I’m working 7 days a week. Bills were getting tight so I decided to tuck my tail in between my legs and cancel my subscription. That’s when Nikki reached out to me. She listened to what I had to say, even though my paraphrasing wasn’t 100% accurate, she didn’t call me out on it, but she stated some very true statements. She then introduced me to L.T. Immediately I felt like they actually cared, and I wasn’t just another membership. They both made me feel not only comfortable, but confident. After some good conversations, I decided to give it one more chance. I signed up for the year, told Nikki this was my last hooray, and if it didn’t work out I would throw this account away. I feel like they both understood my frustration and we talked through what might have gone wrong. Well let me tell you, it was me 1000%. I went back into PBU and started over, but this time I was absorbing the information. I believe after our conversations, I realized what was hurting me. It was my emotions, and not really understanding my risk management. Watching everyone celebrating HUGE wins, I wanted that, and I went all in, and it went south. After starting PBU all over again, I was able to control my emotions, and I’m happy to say, after 1 week I’m up 50%!!!! Paid for my year membership, within a week! You do not have to play every call! 😂 learned this the hard way. I have slowed down, do more DD, and it paid in huge dividends this week. I can’t thank them enough for not letting me just leave.",
        "timestamp": "2022-08-04 00:31:16",
        "total_reactions": 88
    }
]